PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/***************************************************************************//**
* \file cy_device.h
* \version 2.0
*
* This file specifies the structure for core and peripheral block HW base
* addresses, versions, and parameters.
*
********************************************************************************/
#ifndef CY_DEVICE_H_
#define CY_DEVICE_H_

#include <stdint.h>
#include <stddef.h>

#include "cy_utils.h"
#include "startup_cat1d.h"
#include "cmsis_compiler.h"
#ifndef PSE84_PSVP_UUT
    #include "cy_device_headers.h"
#endif
/* CM55 NPU global defines */
#ifndef ETHOSU55
    #define ETHOSU55
#endif
#ifndef ETHOSU_ARCH
    #define ETHOSU_ARCH u55
#endif
/* This define is used to differentiate default clock frequency between PSVP and actual silicon
   To be removed when actual silicon arrives
*/
//#define PSE84_PSVP

/* This is temporary flag until hal or bsp adopts IP enable API Cy_SysClk_PeriGroupSlaveInit
   This flag ensures all necessary IP's gets released from reset in startup code.
*/
/* #define CY_DEVICE_FORCE_IP_ENABLE_IN_STARTUP */

/* This is a feature flag available only for CAT1D devices supporting Cy_SysClk_PeriGroupSlaveInit
*/
#define CY_DEVICE_CONFIGURATOR_IP_ENABLE_FEATURE

/* The SW workaround for RRAM on PSE84 silicon */
#if (defined(CY_IP_MXS22RRAMC_VERSION) && (CY_IP_MXS22RRAMC_VERSION) < 2) && !defined(COMPONENT_CM0P)
    #define WA__PM_0159902_6
#endif

/* Defines a start address of the default vector table */
#ifndef CY_SYS_CM55_DEFAULT_VECTOR_ADDRESS
    /* For PSE84 the default vector table is in ITCM memory */
    #define CY_SYS_CM55_DEFAULT_VECTOR_ADDRESS    (CY_CM55_ITCM_NS_SBUS_BASE)
#endif /* CY_SYS_DEFAULT_VECTOR_ADDRESS */

#if (defined(CY_IP_MXS22SRSS_VERSION) && (CY_IP_MXS22SRSS_VERSION == 1))
    #define WA__DRIVERS_21925
#endif /* (defined(CY_IP_MXS22SRSS_VERSION) && (CY_IP_MXS22SRSS_VERSION == 1)) */

/* These defines come from target specific BSP make file. If they are not defined,
 we can use these default values to avoid compilation errors */

#ifndef CY_RRAM_MAIN_NVM_NS_OFFSET
    #define CY_RRAM_MAIN_NVM_NS_OFFSET 0x0002A000
#endif

#ifndef CY_RRAM_MAIN_NVM_NS_SIZE
    #ifdef CY_DEVICE_IFX_SECURITY_EPC2
        #define CY_RRAM_MAIN_NVM_NS_SIZE 0x00040000
    #else
        #define CY_RRAM_MAIN_NVM_NS_SIZE 0x00016000
    #endif /* CY_DEVICE_IFX_SECURITY_EPC2 */
#endif

#ifndef RRAM_NVM_DATA_NS_OFFSET
    #define RRAM_NVM_DATA_NS_OFFSET 0x0002A000
#endif

#ifndef RRAM_NVM_DATA_NS_SIZE
    #ifdef CY_DEVICE_IFX_SECURITY_EPC2
        #define RRAM_NVM_DATA_NS_SIZE 0x00040000
    #else
        #define RRAM_NVM_DATA_NS_SIZE 0x00016000
    #endif /* CY_DEVICE_IFX_SECURITY_EPC2 */
#endif

#ifndef CY_SMIF0_MAIN_NVM_NS_OFFSET
    #define CY_SMIF0_MAIN_NVM_NS_OFFSET 0x00340000
#endif

#ifndef CY_SMIF0_MAIN_NVM_NS_SIZE
    #define CY_SMIF0_MAIN_NVM_NS_SIZE 0x008C0000
#endif

#ifndef CY_SMIF1_MAIN_NVM_NS_OFFSET
    #define CY_SMIF1_MAIN_NVM_NS_OFFSET 0x00000000
#endif

#ifndef CY_SMIF1_MAIN_NVM_NS_SIZE
    #define CY_SMIF1_MAIN_NVM_NS_SIZE 0x04000000
#endif

#ifndef CY_SOCMEMSRAM_NS_OFFSET
    #define CY_SOCMEMSRAM_NS_OFFSET 0x00000000
#endif

#ifndef CY_SOCMEMSRAM_NS_SIZE
    #define CY_SOCMEMSRAM_NS_SIZE 0x00500000
#endif

#ifndef CY_SRAM0_NS_OFFSET

    #ifdef FLASH_BOOT
        #define CY_SRAM0_NS_OFFSET 0x00055000
    #else
        #define CY_SRAM0_NS_OFFSET 0x00020000
    #endif

#endif

#ifndef CY_SRAM0_NS_SIZE

    #ifdef FLASH_BOOT
        #define CY_SRAM0_NS_SIZE 0x0002B000
    #else
        #define CY_SRAM0_NS_SIZE 0x00060000
    #endif

#endif

#ifndef CY_SRAM0_SHM_S_OFFSET
    #define CY_SRAM0_SHM_S_OFFSET 0x00053000
#endif

#ifndef CY_SRAM0_SHM_S_SIZE
    #define CY_SRAM0_SHM_S_SIZE 0x00002000
#endif

#ifndef CY_SRAM1_NS_OFFSET
    #define CY_SRAM1_NS_OFFSET 0x00000000
#endif

#ifndef CY_SRAM1_NS_SIZE
    #define CY_SRAM1_NS_SIZE 0x0007E000
#endif

#ifndef CY_SRAM1_SHM_NS_OFFSET
    #define CY_SRAM1_SHM_NS_OFFSET 0x0007E000
#endif

#ifndef CY_SRAM1_SHM_NS_SIZE
    #define CY_SRAM1_SHM_NS_SIZE 0x00002000
#endif

#ifndef FLASH_BOOT
    /* RAM BOOOT Defines START*/
    #ifndef CY_CM33_SEC_APP_BOOT_ADDR
        #define CY_CM33_SEC_APP_BOOT_ADDR 0x34000400
    #endif

    #ifndef CY_CM33_NSC_ADDR
        #define CY_CM33_NSC_ADDR 0x1400ff00
    #endif
    #ifndef CY_CM33_NSC_SIZE
        #define CY_CM33_NSC_SIZE 0x00000100
    #endif
    #ifndef CY_CM33_NS_APP_BOOT_ADDR
        #define CY_CM33_NS_APP_BOOT_ADDR 0x24080400
    #endif
    #ifndef CY_CM55_APP_BOOT_ADDR
        #define CY_CM55_APP_BOOT_ADDR 0x26000400
    #endif
    /* RAM BOOOT Defines END*/
#else
    /* FLASH BOOOT Defines START*/
    #ifndef CY_CM33_SEC_APP_BOOT_ADDR
        #define CY_CM33_SEC_APP_BOOT_ADDR 0x18100400
    #endif
    #ifndef CY_CM33_NSC_ADDR
        #ifdef APP_NEXT_LOC_RAM
            #define CY_CM33_NSC_ADDR 0x1202bf00
        #else
            #define CY_CM33_NSC_ADDR 0x1813ff00
        #endif
    #endif
    #ifndef CY_CM33_NSC_SIZE
        #define CY_CM33_NSC_SIZE 0x00000100
    #endif
    #ifndef CY_CM33_NS_APP_BOOT_ADDR
        #define CY_CM33_NS_APP_BOOT_ADDR 0x08340400
    #endif
    #ifndef CY_CM55_APP_BOOT_ADDR
        #define CY_CM55_APP_BOOT_ADDR 0x60580400
    #endif
    /* FLASH BOOOT Defines END*/
#endif

/* DIE_ID and REV_ID registers located in the NS_SFLASH sub-region
   of the RRAM PROTECTED NVM region */
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE               (0x03C2B000UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_SI_REV            (0x03C2B010UL)

/* DIE_ID_0 register masks */
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT0_Pos      (0UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT0_Msk      (0xFFUL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT1_Pos      (8UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT1_Msk      (0xFF00UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT2_Pos      (16UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT2_Msk      (0xFF0000UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_WAFER_Pos     (24UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_WAFER_Msk     (0xFF000000UL)
/* DIE_ID_1 register masks */
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_X_Pos         (0UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_X_Msk         (0xFFUL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_Y_Pos         (8UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_Y_Msk         (0xFF00UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_SORT_Pos      (16UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_SORT_Msk      (0xFF0000UL)
/* DIE_ID_2 register masks */
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_YEAR_Pos      (8UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_DIE_YEAR_Msk      (0xFF00UL)
/* SI_REV register masks */
#define CY_RRAM_PROTECTED_NS_SFLASH_SI_REV_MINOR_Pos  (0UL)
#define CY_RRAM_PROTECTED_NS_SFLASH_SI_REV_MINOR_Msk  (0x1UL)


