PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
#define SMIF_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk     SMIF_CORE_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_TX_CMD_MMIO_FIFO_STATUS_USED4_Pos     SMIF_CORE_TX_CMD_MMIO_FIFO_STATUS_USED4_Pos

#define SMIF_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk    SMIF_CORE_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_TX_DATA_MMIO_FIFO_STATUS_USED4_Pos    SMIF_CORE_TX_DATA_MMIO_FIFO_STATUS_USED4_Pos

#define SMIF_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk    SMIF_CORE_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_RX_DATA_MMIO_FIFO_STATUS_USED4_Pos    SMIF_CORE_RX_DATA_MMIO_FIFO_STATUS_USED4_Pos

#define SMIF_STATUS_BUSY_Msk                       SMIF_CORE_STATUS_BUSY_Msk
#define SMIF_STATUS_BUSY_Pos                       SMIF_CORE_STATUS_BUSY_Pos
#define SMIF_DEVICE_Type                           SMIF_CORE_DEVICE_Type
#define SMIF_Type                                  SMIF_CORE_Type
#define SMIF_Base_Type                             SMIF_STRUCT_Type
#define CY_SMIF_CORE_COUNT                         (2U)
#if defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1U)
    #define CY_SMIF_BRIDGE_REMAP_REGION_COUNT          (8U)
#endif

#define SMIF_FAST_CA_CMD_INV_Msk                   SMIF_CORE_FAST_CA_CMD_INV_Msk
#define SMIF_FAST_CA_CTL_PREF_EN_Msk               SMIF_CORE_FAST_CA_CTL_PREF_EN_Msk
#define SMIF_FAST_CA_CTL_ENABLED_Msk               SMIF_CORE_FAST_CA_CTL_ENABLED_Msk

#define SMIF_SLOW_CA_CMD_INV_Msk                   SMIF_CORE_SLOW_CA_CMD_INV_Msk
#define SMIF_SLOW_CA_CTL_ENABLED_Msk               SMIF_CORE_SLOW_CA_CTL_ENABLED_Msk
#define SMIF_SLOW_CA_CTL_PREF_EN_Msk               SMIF_CORE_SLOW_CA_CTL_PREF_EN_Msk

#define SMIF_SMIF_CRYPTO_CRYPTO_CMD_START_Pos      SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Pos
#define SMIF_SMIF_CRYPTO_CRYPTO_CMD_START_Msk      SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Msk

#define SMIF_DEVICE_CTL_CRYPTO_EN_Msk              SMIF_CORE_DEVICE_CTL_CRYPTO_EN_Msk
#define SMIF_INTR_TR_TX_REQ_Msk                    SMIF_CORE_INTR_TR_TX_REQ_Msk
#define SMIF_INTR_TR_RX_REQ_Msk                    SMIF_CORE_INTR_TR_RX_REQ_Msk
#define SMIF_INTR_XIP_ALIGNMENT_ERROR_Msk          SMIF_CORE_INTR_XIP_ALIGNMENT_ERROR_Msk
#define SMIF_INTR_TX_CMD_FIFO_OVERFLOW_Msk         SMIF_CORE_INTR_TX_CMD_FIFO_OVERFLOW_Msk
#define SMIF_INTR_TX_DATA_FIFO_OVERFLOW_Msk        SMIF_CORE_INTR_TX_DATA_FIFO_OVERFLOW_Msk
#define SMIF_INTR_TR_RX_REQ_Msk                    SMIF_CORE_INTR_TR_RX_REQ_Msk
#define SMIF_INTR_RX_DATA_FIFO_UNDERFLOW_Msk       SMIF_CORE_INTR_RX_DATA_MMIO_FIFO_UNDERFLOW_Msk
#define SMIF_STATUS_BUSY_Msk                       SMIF_CORE_STATUS_BUSY_Msk
#define SMIF_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk    SMIF_CORE_RX_DATA_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk    SMIF_CORE_TX_DATA_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk     SMIF_CORE_TX_CMD_MMIO_FIFO_STATUS_USED4_Msk
#define SMIF_CTL_DESELECT_DELAY_Msk                SMIF_CORE_CTL_DESELECT_DELAY_Msk
#define SMIF_CTL_DESELECT_DELAY_Pos                SMIF_CORE_CTL_DESELECT_DELAY_Pos
#define SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Msk       SMIF_CORE_DEVICE_RD_DATA_CTL_DDR_MODE_Msk
#define SMIF_DEVICE_CTL_DATA_SEL_Msk               SMIF_CORE_DEVICE_CTL_DATA_SEL_Msk
#define SMIF_CTL_ENABLED_Msk                       SMIF_CORE_CTL_ENABLED_Msk
#define SMIF_CTL_ENABLED_Pos                       SMIF_CORE_CTL_ENABLED_Pos
#define SMIF_DEVICE_CTL_DATA_SEL_Msk               SMIF_CORE_DEVICE_CTL_DATA_SEL_Msk
#define SMIF_CTL_XIP_MODE_Pos                      SMIF_CORE_CTL_XIP_MODE_Pos
#define SMIF_CTL_XIP_MODE_Msk                      SMIF_CORE_CTL_XIP_MODE_Msk
#define SMIF_CTL_BLOCK_Pos                         SMIF_CORE_CTL_BLOCK_Pos
#define SMIF_CTL_BLOCK_Msk                         SMIF_CORE_CTL_BLOCK_Msk
#define SMIF_CTL_CLOCK_IF_SEL_Pos                  SMIF_CORE_CTL_CLOCK_IF_SEL_Pos
#define SMIF_CTL_CLOCK_IF_SEL_Msk                  SMIF_CORE_CTL_CLOCK_IF_SEL_Msk

#define SMIF_DEVICE_CTL_DATA_SEL_Pos               SMIF_CORE_DEVICE_CTL_DATA_SEL_Pos
#define SMIF_CRYPTO_CMD_START_Pos                  SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Pos
#define SMIF_CRYPTO_CMD_START_Msk                  SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Msk

#if defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION == 6u)
    #define SMIF0_CORE0_DEVICE0             (SMIF0_CORE_DEVICE0)
    #define SMIF0_CORE0_DEVICE1             (SMIF0_CORE_DEVICE0)
    #define SMIF0_CORE0_DEVICE2             (SMIF0_CORE_DEVICE0)
    #define SMIF0_CORE0_DEVICE3             (SMIF0_CORE_DEVICE0)
    #define SMIF0_CORE1_DEVICE0             (SMIF1_CORE_DEVICE0)
    #define SMIF0_CORE1_DEVICE1             (SMIF1_CORE_DEVICE1)
    #define SMIF0_CORE1_DEVICE2             (SMIF1_CORE_DEVICE2)
    #define SMIF0_CORE1_DEVICE3             (SMIF1_CORE_DEVICE3)
#endif

#if defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION == 5)
    #define CY_SMIF_GPIO_BASE                         ((uint32_t)SMIF0_CORE0_SMIF_GPIO_SMIF_PRT0)
    #define CY_SMIF_HSIOM_BASE                        ((uint32_t)SMIF0_CORE0_SMIF_HSIOM_SMIF_PRT0)
    #define CY_SMIF_SECURE_HSIOM_BASE                 ((uint32_t)SMIF0_CORE0_SMIF_HSIOM_SMIF_SECURE_PRT0)
#else
    #define CY_SMIF_GPIO_BASE                         ((uint32_t)SMIF0_CORE_SMIF_GPIO_SMIF_PRT0)
    #define CY_SMIF_HSIOM_BASE                        ((uint32_t)SMIF0_CORE_SMIF_HSIOM_SMIF_PRT0)
    #define CY_SMIF_SECURE_HSIOM_BASE                 ((uint32_t)SMIF0_CORE_SMIF_HSIOM_SMIF_SECURE_PRT0)
#endif
#define SMIF_CRYPTO_CMD(base)            (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_CMD)
#define SMIF_CRYPTO_ADDR(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_ADDR)
#define SMIF_CRYPTO_MASK(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_MASK)
#define SMIF_CRYPTO_SUBREGION(base)      (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_SUBREGION)
#define SMIF_CRYPTO_INPUT0(base)         (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_INPUT0)
#define SMIF_CRYPTO_INPUT1(base)         (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_INPUT1)
#define SMIF_CRYPTO_INPUT2(base)         (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_INPUT2)
#define SMIF_CRYPTO_INPUT3(base)         (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_INPUT3)
#define SMIF_CRYPTO_KEY0(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_KEY0)
#define SMIF_CRYPTO_KEY1(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_KEY1)
#define SMIF_CRYPTO_KEY2(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_KEY2)
#define SMIF_CRYPTO_KEY3(base)           (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_KEY3)
#define SMIF_CRYPTO_OUTPUT0(base)        (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_OUTPUT0)
#define SMIF_CRYPTO_OUTPUT1(base)        (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_OUTPUT1)
#define SMIF_CRYPTO_OUTPUT2(base)        (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_OUTPUT2)
#define SMIF_CRYPTO_OUTPUT3(base)        (((SMIF_CORE_Type*) base)->SMIF_CRYPTO_BLOCK[0].CRYPTO_OUTPUT3)

#define SMIF_CRYPTO_IDX(base, deviceIndex)                 (((SMIF_CORE_Type *)(base))->SMIF_CRYPTO_BLOCK[deviceIndex])

#define SMIF_CRYPTO_IDX_CMD(base, deviceIndex)             (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_CMD)
#define SMIF_CRYPTO_IDX_ADDR(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_ADDR)
#define SMIF_CRYPTO_IDX_MASK(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_MASK)
#define SMIF_CRYPTO_IDX_SUBREGION(base, deviceIndex)       (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_SUBREGION)
#define SMIF_CRYPTO_IDX_INPUT0(base, deviceIndex)          (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_INPUT0)
#define SMIF_CRYPTO_IDX_INPUT1(base, deviceIndex)          (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_INPUT1)
#define SMIF_CRYPTO_IDX_INPUT2(base, deviceIndex)          (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_INPUT2)
#define SMIF_CRYPTO_IDX_INPUT3(base, deviceIndex)          (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_INPUT3)
#define SMIF_CRYPTO_IDX_KEY0(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_KEY0)
#define SMIF_CRYPTO_IDX_KEY1(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_KEY1)
#define SMIF_CRYPTO_IDX_KEY2(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_KEY2)
#define SMIF_CRYPTO_IDX_KEY3(base, deviceIndex)            (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_KEY3)
#define SMIF_CRYPTO_IDX_OUTPUT0(base, deviceIndex)         (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_OUTPUT0)
#define SMIF_CRYPTO_IDX_OUTPUT1(base, deviceIndex)         (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_OUTPUT1)
#define SMIF_CRYPTO_IDX_OUTPUT2(base, deviceIndex)         (SMIF_CRYPTO_IDX(base, deviceIndex).CRYPTO_OUTPUT2)

