PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
#if defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1U)
    #define SMIF_BRIDGE_CTL(base)                              ((((SMIF_Base_Type *)base)->SMIF_BRIDGE).CTL)
    #define SMIF_REMAPREGION_CTL(base, index)                  (((((SMIF_Base_Type *)base)->SMIF_BRIDGE).SMIF_REMAP_REGION[index]).CTL)
    #define SMIF_REMAPREGION_ADDR(base, index)                 (((((SMIF_Base_Type *)base)->SMIF_BRIDGE).SMIF_REMAP_REGION[index]).ADDR)
    #define SMIF_REMAPREGION_MASK(base, index)                 (((((SMIF_Base_Type *)base)->SMIF_BRIDGE).SMIF_REMAP_REGION[index]).MASK)
    #define SMIF_REMAPREGION_SMIF0_REMAP(base, index)          (((((SMIF_Base_Type *)base)->SMIF_BRIDGE).SMIF_REMAP_REGION[index]).SMIF0_REMAP)
    #define SMIF_REMAPREGION_SMIF1_REMAP(base, index)          (((((SMIF_Base_Type *)base)->SMIF_BRIDGE).SMIF_REMAP_REGION[index]).SMIF1_REMAP)
#endif

#define SMIF_DEVICE_CTL(base)               (((SMIF_CORE_DEVICE_Type *)(base))->CTL)
#define SMIF_DEVICE_ADDR(base)              (((SMIF_CORE_DEVICE_Type *)(base))->ADDR)
#define SMIF_DEVICE_ADDR_CTL(base)          (((SMIF_CORE_DEVICE_Type *)(base))->ADDR_CTL)
#define SMIF_DEVICE_MASK(base)              (((SMIF_CORE_DEVICE_Type *)(base))->MASK)
#define SMIF_DEVICE_RD_CMD_CTL(base)        (((SMIF_CORE_DEVICE_Type *)(base))->RD_CMD_CTL)
#define SMIF_DEVICE_RD_ADDR_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->RD_ADDR_CTL)
#define SMIF_DEVICE_RD_MODE_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->RD_MODE_CTL)
#define SMIF_DEVICE_RD_DUMMY_CTL(base)      (((SMIF_CORE_DEVICE_Type *)(base))->RD_DUMMY_CTL)
#define SMIF_DEVICE_RD_DATA_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->RD_DATA_CTL)
#define SMIF_DEVICE_RD_BOUND_CTL(base)      (((SMIF_DEVICE_Type *)(base))->RD_BOUND_CTL)
#define SMIF_DEVICE_WR_CMD_CTL(base)        (((SMIF_CORE_DEVICE_Type *)(base))->WR_CMD_CTL)
#define SMIF_DEVICE_WR_ADDR_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->WR_ADDR_CTL)
#define SMIF_DEVICE_WR_MODE_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->WR_MODE_CTL)
#define SMIF_DEVICE_WR_DUMMY_CTL(base)      (((SMIF_CORE_DEVICE_Type *)(base))->WR_DUMMY_CTL)
#define SMIF_DEVICE_WR_DATA_CTL(base)       (((SMIF_CORE_DEVICE_Type *)(base))->WR_DATA_CTL)
#define SMIF_DEVICE_RX_CAPTURE_CONFIG(base) (((SMIF_CORE_DEVICE_Type *)(base))->RX_CAPTURE_CONFIG)
#define SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(base) (((SMIF_CORE_DEVICE_Type *)(base))->HB_FW_DEL_TAP_SEL_0)
#define SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(base) (((SMIF_CORE_DEVICE_Type *)(base))->HB_FW_DEL_TAP_SEL_1)


#define SMIF_DEVICE_IDX(base, deviceIndex)                 (((SMIF_CORE_Type *)(base))->DEVICE[deviceIndex])

#define SMIF_DEVICE_IDX_CTL(base, deviceIndex)             (SMIF_DEVICE_IDX(base, deviceIndex).CTL)
#define SMIF_DEVICE_IDX_ADDR(base, deviceIndex)            (SMIF_DEVICE_IDX(base, deviceIndex).ADDR)
#define SMIF_DEVICE_IDX_ADDR_CTL(base, deviceIndex)        (SMIF_DEVICE_IDX(base, deviceIndex).ADDR_CTL)
#define SMIF_DEVICE_IDX_MASK(base, deviceIndex)            (SMIF_DEVICE_IDX(base, deviceIndex).MASK)
#define SMIF_DEVICE_IDX_RD_CMD_CTL(base, deviceIndex)      (SMIF_DEVICE_IDX(base, deviceIndex).RD_CMD_CTL)
#define SMIF_DEVICE_IDX_RD_ADDR_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_ADDR_CTL)
#define SMIF_DEVICE_IDX_RD_MODE_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_MODE_CTL)
#define SMIF_DEVICE_IDX_RD_DUMMY_CTL(base, deviceIndex)    (SMIF_DEVICE_IDX(base, deviceIndex).RD_DUMMY_CTL)
#define SMIF_DEVICE_IDX_RD_DATA_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RD_DATA_CTL)
#define SMIF_DEVICE_IDX_WR_CMD_CTL(base, deviceIndex)      (SMIF_DEVICE_IDX(base, deviceIndex).WR_CMD_CTL)
#define SMIF_DEVICE_IDX_WR_ADDR_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_ADDR_CTL)
#define SMIF_DEVICE_IDX_WR_MODE_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_MODE_CTL)
#define SMIF_DEVICE_IDX_WR_DUMMY_CTL(base, deviceIndex)    (SMIF_DEVICE_IDX(base, deviceIndex).WR_DUMMY_CTL)
#define SMIF_DEVICE_IDX_WR_DATA_CTL(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).WR_DATA_CTL)
#define SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, deviceIndex)     (SMIF_DEVICE_IDX(base, deviceIndex).RX_CAPTURE_CONFIG)

#define SMIF_CORE_IDX(base, coreIndex)                     (((SMIF_Type *)(base))->CORE[coreIndex])

#define SMIF_CTL(base)                            (((SMIF_CORE_Type *)(base))->CTL)
#define SMIF_CTL2(base)                           (((SMIF_CORE_Type *)(base))->CTL2)
#define SMIF_STATUS(base)                         (((SMIF_CORE_Type *)(base))->STATUS)
#define SMIF_INT_CLOCK_DELAY_TAP_SEL0(base)       (((SMIF_CORE_Type *)(base))->INT_CLOCK_DELAY_TAP_SEL0)
#define SMIF_INT_CLOCK_DELAY_TAP_SEL1(base)       (((SMIF_CORE_Type *)(base))->INT_CLOCK_DELAY_TAP_SEL1)
#define SMIF_DLP_DELAY_TAP_SEL0(base)             (((SMIF_CORE_Type *)(base))->DLP_DELAY_TAP_SEL0)
#define SMIF_DLP_DELAY_TAP_SEL1(base)             (((SMIF_CORE_Type *)(base))->DLP_DELAY_TAP_SEL1)
#define SMIF_DLP_CTL(base)                        (((SMIF_CORE_Type *)(base))->DLP_CTL)
#define SMIF_DL_STATUS0(base)                     (((SMIF_CORE_Type *)(base))->DL_STATUS0)
#define SMIF_DL_STATUS1(base)                     (((SMIF_CORE_Type *)(base))->DL_STATUS1)
#define SMIF_TX_CMD_FIFO_STATUS(base)             (((SMIF_CORE_Type *)(base))->TX_CMD_FIFO_STATUS)
#define SMIF_TX_CMD_MMIO_FIFO_STATUS(base)        (((SMIF_CORE_Type *)(base))->TX_CMD_MMIO_FIFO_STATUS)
#define SMIF_TX_CMD_MMIO_FIFO_WR(base)            (((SMIF_CORE_Type *)(base))->TX_CMD_MMIO_FIFO_WR)
#define SMIF_TX_DATA_MMIO_FIFO_CTL(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_CTL)
#define SMIF_TX_DATA_FIFO_STATUS(base)            (((SMIF_CORE_Type *)(base))->TX_DATA_FIFO_STATUS)
#define SMIF_TX_DATA_MMIO_FIFO_STATUS(base)       (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_STATUS)
#define SMIF_TX_DATA_MMIO_FIFO_WR1(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR1)
#define SMIF_TX_DATA_MMIO_FIFO_WR2(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR2)
#define SMIF_TX_DATA_MMIO_FIFO_WR4(base)          (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR4)
#define SMIF_TX_DATA_MMIO_FIFO_WR1ODD(base)       (((SMIF_CORE_Type *)(base))->TX_DATA_MMIO_FIFO_WR1ODD)
#define SMIF_RX_DATA_MMIO_FIFO_CTL(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_CTL)
#define SMIF_RX_DATA_MMIO_FIFO_STATUS(base)       (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_STATUS)
#define SMIF_RX_DATA_FIFO_STATUS(base)            (((SMIF_CORE_Type *)(base))->RX_DATA_FIFO_STATUS)
#define SMIF_RX_DATA_MMIO_FIFO_RD1(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD1)
#define SMIF_RX_DATA_MMIO_FIFO_RD2(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD2)
#define SMIF_RX_DATA_MMIO_FIFO_RD4(base)          (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD4)
#define SMIF_RX_DATA_MMIO_FIFO_RD1_SILENT(base)   (((SMIF_CORE_Type *)(base))->RX_DATA_MMIO_FIFO_RD1_SILENT)
#define SMIF_SLOW_CA_CTL(base)                    (((SMIF_CORE_Type *)(base))->SLOW_CA_CTL)
#define SMIF_SLOW_CA_CMD(base)                    (((SMIF_CORE_Type *)(base))->SLOW_CA_CMD)
#define SMIF_FAST_CA_CTL(base)                    (((SMIF_CORE_Type *)(base))->FAST_CA_CTL)
#define SMIF_FAST_CA_CMD(base)                    (((SMIF_CORE_Type *)(base))->FAST_CA_CMD)
#define SMIF_CRC_CMD(base)                        (((SMIF_CORE_Type *)(base))->CRC_CMD)
#define SMIF_CRC_INPUT0(base)                     (((SMIF_CORE_Type *)(base))->CRC_INPUT0)
#define SMIF_CRC_INPUT1(base)                     (((SMIF_CORE_Type *)(base))->CRC_INPUT1)
#define SMIF_CRC_OUTPUT(base)                     (((SMIF_CORE_Type *)(base))->CRC_OUTPUT)
#define SMIF_INTR(base)                           (((SMIF_CORE_Type *)(base))->INTR)
#define SMIF_INTR_SET(base)                       (((SMIF_CORE_Type *)(base))->INTR_SET)
#define SMIF_INTR_MASK(base)                      (((SMIF_CORE_Type *)(base))->INTR_MASK)
#define SMIF_INTR_MASKED(base)                    (((SMIF_CORE_Type *)(base))->INTR_MASKED)
#define SMIF_CLK_HSIOM(base)                      (((SMIF_CORE_Type *)(base))->SMIF_HSIOM.SMIF_PRT[1].PORT_SEL0)
#define SMIF_RWDS_HSIOM(base)                     (((SMIF_CORE_Type *)(base))->SMIF_HSIOM.SMIF_PRT[2].PORT_SEL0)
#define SMIF_CLK_DRIVEMODE(base)                  (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[1].CFG)
#define SMIF_RWDS_DRIVEMODE(base)                 (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[2].CFG)
#define SMIF_CLK_DRIVE_STRENGTH(base)             (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[1].CFG_DRIVE_EXT0)
#define SMIF_RWDS_DRIVE_STRENGTH(base)            (((SMIF_CORE_Type *)(base))->SMIF_GPIO.SMIF_PRT[2].CFG_DRIVE_EXT0)
#define SMIF_IDAC(base)                           (((SMIF_CORE_Type *)(base))->DLL_IDAC)

/* Backward Compatibility - Default SMIF instance pointing to CORE0 */
#if (CY_IP_MXSMIF_VERSION == 5)
    #define SMIF_HW SMIF0_CORE0
#else
    #define SMIF_HW SMIF0_CORE
#endif

#define SMIF_config SMIF_0_CORE_0_config

#if (CY_IP_MXSMIF_VERSION == 6)
    #define SMIF_DEVICE_NR SMIF0_DEVICE_NR
#endif

