PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/* Redefine M33 DMA macros */
#define cpuss_interrupts_dw0_0_IRQn  m33syscpuss_interrupts_dw0_0_IRQn
#define cpuss_interrupts_dw0_1_IRQn  m33syscpuss_interrupts_dw0_1_IRQn
#define cpuss_interrupts_dw0_2_IRQn  m33syscpuss_interrupts_dw0_2_IRQn
#define cpuss_interrupts_dw0_3_IRQn  m33syscpuss_interrupts_dw0_3_IRQn
#define cpuss_interrupts_dw0_4_IRQn  m33syscpuss_interrupts_dw0_4_IRQn
#define cpuss_interrupts_dw0_5_IRQn  m33syscpuss_interrupts_dw0_5_IRQn
#define cpuss_interrupts_dw0_6_IRQn  m33syscpuss_interrupts_dw0_6_IRQn
#define cpuss_interrupts_dw0_7_IRQn  m33syscpuss_interrupts_dw0_7_IRQn
#define cpuss_interrupts_dw0_8_IRQn  m33syscpuss_interrupts_dw0_8_IRQn
#define cpuss_interrupts_dw0_9_IRQn  m33syscpuss_interrupts_dw0_9_IRQn
#define cpuss_interrupts_dw0_10_IRQn m33syscpuss_interrupts_dw0_10_IRQn
#define cpuss_interrupts_dw0_11_IRQn m33syscpuss_interrupts_dw0_11_IRQn
#define cpuss_interrupts_dw0_12_IRQn m33syscpuss_interrupts_dw0_12_IRQn
#define cpuss_interrupts_dw0_13_IRQn m33syscpuss_interrupts_dw0_13_IRQn
#define cpuss_interrupts_dw0_14_IRQn m33syscpuss_interrupts_dw0_14_IRQn
#define cpuss_interrupts_dw0_15_IRQn m33syscpuss_interrupts_dw0_15_IRQn
#define cpuss_interrupts_dw1_0_IRQn  m33syscpuss_interrupts_dw1_0_IRQn
#define cpuss_interrupts_dw1_1_IRQn  m33syscpuss_interrupts_dw1_1_IRQn
#define cpuss_interrupts_dw1_2_IRQn  m33syscpuss_interrupts_dw1_2_IRQn
#define cpuss_interrupts_dw1_3_IRQn  m33syscpuss_interrupts_dw1_3_IRQn
#define cpuss_interrupts_dw1_4_IRQn  m33syscpuss_interrupts_dw1_4_IRQn
#define cpuss_interrupts_dw1_5_IRQn  m33syscpuss_interrupts_dw1_5_IRQn
#define cpuss_interrupts_dw1_6_IRQn  m33syscpuss_interrupts_dw1_6_IRQn
#define cpuss_interrupts_dw1_7_IRQn  m33syscpuss_interrupts_dw1_7_IRQn
#define cpuss_interrupts_dw1_8_IRQn  m33syscpuss_interrupts_dw1_8_IRQn
#define cpuss_interrupts_dw1_9_IRQn  m33syscpuss_interrupts_dw1_9_IRQn
#define cpuss_interrupts_dw1_10_IRQn m33syscpuss_interrupts_dw1_10_IRQn
#define cpuss_interrupts_dw1_11_IRQn m33syscpuss_interrupts_dw1_11_IRQn
#define cpuss_interrupts_dw1_12_IRQn m33syscpuss_interrupts_dw1_12_IRQn
#define cpuss_interrupts_dw1_13_IRQn m33syscpuss_interrupts_dw1_13_IRQn
#define cpuss_interrupts_dw1_14_IRQn m33syscpuss_interrupts_dw1_14_IRQn
#define cpuss_interrupts_dw1_15_IRQn m33syscpuss_interrupts_dw1_15_IRQn

/*******************************************************************************
*                AXIDMAC
*******************************************************************************/
#define AXI_DMAC_Type SAXI_DMAC_Type
#define CY_AXIDMAC_CH_NR                    (AXI_DMAC_CH_NR)
#define AXIDMAC_CTL(base)                   (((AXI_DMAC_Type*)(base))->CTL)
#define AXIDMAC_STATUS(base)                (((AXI_DMAC_Type*)(base))->STATUS)
#define AXIDMAC_ACTIVE(base)                (((AXI_DMAC_Type const*)(base))->ACTIVE)
#define AXIDMAC_CH(base, chan)              (&(((AXI_DMAC_Type*)(base))->CH[(chan)]))
#define AXIDMAC_CH_CTL(base, chan)          (AXIDMAC_CH(base, chan)->CTL)
#define AXIDMAC_CH_IDX(base, chan)          (AXIDMAC_CH(base, chan)->IDX)
#define AXIDMAC_CH_CURR(base, chan)         (AXIDMAC_CH(base, chan)->CURR)
#define AXIDMAC_CH_DESCR_SRC(base, chan)    (AXIDMAC_CH(base, chan)->DESCR_SRC)
#define AXIDMAC_CH_DESCR_DST(base, chan)    (AXIDMAC_CH(base, chan)->DESCR_DST)
#define AXIDMAC_CH_INTR(base, chan)         (AXIDMAC_CH(base, chan)->INTR)
#define AXIDMAC_CH_INTR_SET(base, chan)     (AXIDMAC_CH(base, chan)->INTR_SET)
#define AXIDMAC_CH_INTR_MASK(base, chan)    (AXIDMAC_CH(base, chan)->INTR_MASK)
#define AXIDMAC_CH_INTR_MASKED(base, chan)  (AXIDMAC_CH(base, chan)->INTR_MASKED)
#define AXIDMAC_CH_TR_CMD(base, chan)       (AXIDMAC_CH(base, chan)->TR_CMD)

/* SAXI_DMAC_CH.CTL */
#define AXI_DMAC_CH_CTL_P_Pos                  SAXI_DMAC_CH_CTL_P_Pos
#define AXI_DMAC_CH_CTL_P_Msk                  SAXI_DMAC_CH_CTL_P_Msk
#define AXI_DMAC_CH_CTL_NS_Pos                 SAXI_DMAC_CH_CTL_NS_Pos
#define AXI_DMAC_CH_CTL_NS_Msk                 SAXI_DMAC_CH_CTL_NS_Msk
#define AXI_DMAC_CH_CTL_B_Pos                  SAXI_DMAC_CH_CTL_B_Pos
#define AXI_DMAC_CH_CTL_B_Msk                  SAXI_DMAC_CH_CTL_B_Msk
#define AXI_DMAC_CH_CTL_PC_Pos                 SAXI_DMAC_CH_CTL_PC_Pos
#define AXI_DMAC_CH_CTL_PC_Msk                 SAXI_DMAC_CH_CTL_PC_Msk
#define AXI_DMAC_CH_CTL_PRIO_Pos               SAXI_DMAC_CH_CTL_PRIO_Pos
#define AXI_DMAC_CH_CTL_PRIO_Msk               SAXI_DMAC_CH_CTL_PRIO_Msk
#define AXI_DMAC_CH_CTL_ENABLED_Pos            SAXI_DMAC_CH_CTL_ENABLED_Pos
#define AXI_DMAC_CH_CTL_ENABLED_Msk            SAXI_DMAC_CH_CTL_ENABLED_Msk
/* SAXI_DMAC_CH.STATUS */
#define AXI_DMAC_CH_STATUS_ENABLED_Pos         SAXI_DMAC_CH_STATUS_ENABLED_Pos
#define AXI_DMAC_CH_STATUS_ENABLED_Msk         SAXI_DMAC_CH_STATUS_ENABLED_Msk
/* SAXI_DMAC_CH.IDX */
#define AXI_DMAC_CH_IDX_X_Pos                  SAXI_DMAC_CH_IDX_X_Pos
#define AXI_DMAC_CH_IDX_X_Msk                  SAXI_DMAC_CH_IDX_X_Msk
#define AXI_DMAC_CH_IDX_Y_Pos                  SAXI_DMAC_CH_IDX_Y_Pos
#define AXI_DMAC_CH_IDX_Y_Msk                  SAXI_DMAC_CH_IDX_Y_Msk
/* SAXI_DMAC_CH.SRC */
#define AXI_DMAC_CH_SRC_ADDR_Pos               SAXI_DMAC_CH_SRC_ADDR_Pos
#define AXI_DMAC_CH_SRC_ADDR_Msk               SAXI_DMAC_CH_SRC_ADDR_Msk
/* SAXI_DMAC_CH.DST */
#define AXI_DMAC_CH_DST_ADDR_Pos               SAXI_DMAC_CH_DST_ADDR_Pos
#define AXI_DMAC_CH_DST_ADDR_Msk               SAXI_DMAC_CH_DST_ADDR_Msk
/* SAXI_DMAC_CH.M_IDX */
#define AXI_DMAC_CH_M_IDX_M_Pos                SAXI_DMAC_CH_M_IDX_M_Pos
#define AXI_DMAC_CH_M_IDX_M_Msk                SAXI_DMAC_CH_M_IDX_M_Msk
/* SAXI_DMAC_CH.CURR */
#define AXI_DMAC_CH_CURR_PTR_Pos               SAXI_DMAC_CH_CURR_PTR_Pos
#define AXI_DMAC_CH_CURR_PTR_Msk               SAXI_DMAC_CH_CURR_PTR_Msk
/* SAXI_DMAC_CH.TR_CMD */
#define AXI_DMAC_CH_TR_CMD_ACTIVATE_Pos        SAXI_DMAC_CH_TR_CMD_ACTIVATE_Pos
#define AXI_DMAC_CH_TR_CMD_ACTIVATE_Msk        SAXI_DMAC_CH_TR_CMD_ACTIVATE_Msk
/* SAXI_DMAC_CH.DESCR_STATUS */
#define AXI_DMAC_CH_DESCR_STATUS_VALID_Pos     SAXI_DMAC_CH_DESCR_STATUS_VALID_Pos
#define AXI_DMAC_CH_DESCR_STATUS_VALID_Msk     SAXI_DMAC_CH_DESCR_STATUS_VALID_Msk
/* SAXI_DMAC_CH.DESCR_CTL */
#define AXI_DMAC_CH_DESCR_CTL_WAIT_FOR_DEACT_Pos     SAXI_DMAC_CH_DESCR_CTL_WAIT_FOR_DEACT_Pos
#define AXI_DMAC_CH_DESCR_CTL_WAIT_FOR_DEACT_Msk     SAXI_DMAC_CH_DESCR_CTL_WAIT_FOR_DEACT_Msk
#define AXI_DMAC_CH_DESCR_CTL_INTR_TYPE_Pos          SAXI_DMAC_CH_DESCR_CTL_INTR_TYPE_Pos
#define AXI_DMAC_CH_DESCR_CTL_INTR_TYPE_Msk          SAXI_DMAC_CH_DESCR_CTL_INTR_TYPE_Msk
#define AXI_DMAC_CH_DESCR_CTL_TR_OUT_TYPE_Pos        SAXI_DMAC_CH_DESCR_CTL_TR_OUT_TYPE_Pos
#define AXI_DMAC_CH_DESCR_CTL_TR_OUT_TYPE_Msk        SAXI_DMAC_CH_DESCR_CTL_TR_OUT_TYPE_Msk
#define AXI_DMAC_CH_DESCR_CTL_TR_IN_TYPE_Pos         SAXI_DMAC_CH_DESCR_CTL_TR_IN_TYPE_Pos
#define AXI_DMAC_CH_DESCR_CTL_TR_IN_TYPE_Msk         SAXI_DMAC_CH_DESCR_CTL_TR_IN_TYPE_Msk
#define AXI_DMAC_CH_DESCR_CTL_DATA_PREFETCH_Pos      SAXI_DMAC_CH_DESCR_CTL_DATA_PREFETCH_Pos
#define AXI_DMAC_CH_DESCR_CTL_DATA_PREFETCH_Msk      SAXI_DMAC_CH_DESCR_CTL_DATA_PREFETCH_Msk
#define AXI_DMAC_CH_DESCR_CTL_CH_DISABLE_Pos         SAXI_DMAC_CH_DESCR_CTL_CH_DISABLE_Pos
#define AXI_DMAC_CH_DESCR_CTL_CH_DISABLE_Msk         SAXI_DMAC_CH_DESCR_CTL_CH_DISABLE_Msk
#define AXI_DMAC_CH_DESCR_CTL_DESCR_TYPE_Pos         SAXI_DMAC_CH_DESCR_CTL_DESCR_TYPE_Pos
#define AXI_DMAC_CH_DESCR_CTL_DESCR_TYPE_Msk         SAXI_DMAC_CH_DESCR_CTL_DESCR_TYPE_Msk
/* SAXI_DMAC_CH.DESCR_SRC */
#define AXI_DMAC_CH_DESCR_SRC_ADDR_Pos         SAXI_DMAC_CH_DESCR_SRC_ADDR_Pos
#define AXI_DMAC_CH_DESCR_SRC_ADDR_Msk         SAXI_DMAC_CH_DESCR_SRC_ADDR_Msk
/* SAXI_DMAC_CH.DESCR_DST */
#define AXI_DMAC_CH_DESCR_DST_ADDR_Pos         SAXI_DMAC_CH_DESCR_DST_ADDR_Pos
#define AXI_DMAC_CH_DESCR_DST_ADDR_Msk         SAXI_DMAC_CH_DESCR_DST_ADDR_Msk
/* SAXI_DMAC_CH.DESCR_M_SIZE */
#define AXI_DMAC_CH_DESCR_M_SIZE_M_COUNT_Pos   SAXI_DMAC_CH_DESCR_M_SIZE_M_COUNT_Pos
#define AXI_DMAC_CH_DESCR_M_SIZE_M_COUNT_Msk   SAXI_DMAC_CH_DESCR_M_SIZE_M_COUNT_Msk
/* SAXI_DMAC_CH.DESCR_X_SIZE */
#define AXI_DMAC_CH_DESCR_X_SIZE_X_COUNT_Pos   SAXI_DMAC_CH_DESCR_X_SIZE_X_COUNT_Pos
#define AXI_DMAC_CH_DESCR_X_SIZE_X_COUNT_Msk   SAXI_DMAC_CH_DESCR_X_SIZE_X_COUNT_Msk
/* SAXI_DMAC_CH.DESCR_X_INCR */
#define AXI_DMAC_CH_DESCR_X_INCR_SRC_X_Pos     SAXI_DMAC_CH_DESCR_X_INCR_SRC_X_Pos
#define AXI_DMAC_CH_DESCR_X_INCR_SRC_X_Msk     SAXI_DMAC_CH_DESCR_X_INCR_SRC_X_Msk
#define AXI_DMAC_CH_DESCR_X_INCR_DST_X_Pos     SAXI_DMAC_CH_DESCR_X_INCR_DST_X_Pos
#define AXI_DMAC_CH_DESCR_X_INCR_DST_X_Msk     SAXI_DMAC_CH_DESCR_X_INCR_DST_X_Msk
/* SAXI_DMAC_CH.DESCR_Y_SIZE */
#define AXI_DMAC_CH_DESCR_Y_SIZE_Y_COUNT_Pos   SAXI_DMAC_CH_DESCR_Y_SIZE_Y_COUNT_Pos
#define AXI_DMAC_CH_DESCR_Y_SIZE_Y_COUNT_Msk   SAXI_DMAC_CH_DESCR_Y_SIZE_Y_COUNT_Msk
/* SAXI_DMAC_CH.DESCR_Y_INCR */
#define AXI_DMAC_CH_DESCR_Y_INCR_SRC_Y_Pos     SAXI_DMAC_CH_DESCR_Y_INCR_SRC_Y_Pos
#define AXI_DMAC_CH_DESCR_Y_INCR_SRC_Y_Msk     SAXI_DMAC_CH_DESCR_Y_INCR_SRC_Y_Msk
#define AXI_DMAC_CH_DESCR_Y_INCR_DST_Y_Pos     SAXI_DMAC_CH_DESCR_Y_INCR_DST_Y_Pos
#define AXI_DMAC_CH_DESCR_Y_INCR_DST_Y_Msk     SAXI_DMAC_CH_DESCR_Y_INCR_DST_Y_Msk
/* SAXI_DMAC_CH.DESCR_NEXT */
#define AXI_DMAC_CH_DESCR_NEXT_PTR_Pos         SAXI_DMAC_CH_DESCR_NEXT_PTR_Pos
#define AXI_DMAC_CH_DESCR_NEXT_PTR_Msk         SAXI_DMAC_CH_DESCR_NEXT_PTR_Msk
/* SAXI_DMAC_CH.INTR */
#define AXI_DMAC_CH_INTR_COMPLETION_Pos          SAXI_DMAC_CH_INTR_COMPLETION_Pos
#define AXI_DMAC_CH_INTR_COMPLETION_Msk          SAXI_DMAC_CH_INTR_COMPLETION_Msk
#define AXI_DMAC_CH_INTR_SRC_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_SRC_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_SRC_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_SRC_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_DST_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_DST_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_DST_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_DST_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_INVALID_DESCR_TYPE_Pos  SAXI_DMAC_CH_INTR_INVALID_DESCR_TYPE_Pos
#define AXI_DMAC_CH_INTR_INVALID_DESCR_TYPE_Msk  SAXI_DMAC_CH_INTR_INVALID_DESCR_TYPE_Msk
#define AXI_DMAC_CH_INTR_CURR_PTR_NULL_Pos       SAXI_DMAC_CH_INTR_CURR_PTR_NULL_Pos
#define AXI_DMAC_CH_INTR_CURR_PTR_NULL_Msk       SAXI_DMAC_CH_INTR_CURR_PTR_NULL_Msk
#define AXI_DMAC_CH_INTR_ACTIVE_CH_DISABLED_Pos  SAXI_DMAC_CH_INTR_ACTIVE_CH_DISABLED_Pos
#define AXI_DMAC_CH_INTR_ACTIVE_CH_DISABLED_Msk  SAXI_DMAC_CH_INTR_ACTIVE_CH_DISABLED_Msk
#define AXI_DMAC_CH_INTR_DESCR_BUS_ERROR_Pos     SAXI_DMAC_CH_INTR_DESCR_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_DESCR_BUS_ERROR_Msk     SAXI_DMAC_CH_INTR_DESCR_BUS_ERROR_Msk
/* SAXI_DMAC_CH.INTR_SET */
#define AXI_DMAC_CH_INTR_SET_COMPLETION_Pos          SAXI_DMAC_CH_INTR_SET_COMPLETION_Pos
#define AXI_DMAC_CH_INTR_SET_COMPLETION_Msk          SAXI_DMAC_CH_INTR_SET_COMPLETION_Msk
#define AXI_DMAC_CH_INTR_SET_SRC_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_SET_SRC_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_SET_SRC_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_SET_SRC_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_SET_DST_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_SET_DST_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_SET_DST_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_SET_DST_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_SET_INVALID_DESCR_TYPE_Pos  SAXI_DMAC_CH_INTR_SET_INVALID_DESCR_TYPE_Pos
#define AXI_DMAC_CH_INTR_SET_INVALID_DESCR_TYPE_Msk  SAXI_DMAC_CH_INTR_SET_INVALID_DESCR_TYPE_Msk
#define AXI_DMAC_CH_INTR_SET_CURR_PTR_NULL_Pos       SAXI_DMAC_CH_INTR_SET_CURR_PTR_NULL_Pos
#define AXI_DMAC_CH_INTR_SET_CURR_PTR_NULL_Msk       SAXI_DMAC_CH_INTR_SET_CURR_PTR_NULL_Msk
#define AXI_DMAC_CH_INTR_SET_ACTIVE_CH_DISABLED_Pos  SAXI_DMAC_CH_INTR_SET_ACTIVE_CH_DISABLED_Pos
#define AXI_DMAC_CH_INTR_SET_ACTIVE_CH_DISABLED_Msk  SAXI_DMAC_CH_INTR_SET_ACTIVE_CH_DISABLED_Msk
#define AXI_DMAC_CH_INTR_SET_DESCR_BUS_ERROR_Pos     SAXI_DMAC_CH_INTR_SET_DESCR_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_SET_DESCR_BUS_ERROR_Msk     SAXI_DMAC_CH_INTR_SET_DESCR_BUS_ERROR_Msk
/* SAXI_DMAC_CH.INTR_MASK */
#define AXI_DMAC_CH_INTR_MASK_COMPLETION_Pos          SAXI_DMAC_CH_INTR_MASK_COMPLETION_Pos
#define AXI_DMAC_CH_INTR_MASK_COMPLETION_Msk          SAXI_DMAC_CH_INTR_MASK_COMPLETION_Msk
#define AXI_DMAC_CH_INTR_MASK_SRC_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_MASK_SRC_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASK_SRC_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_MASK_SRC_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_MASK_DST_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_MASK_DST_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASK_DST_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_MASK_DST_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_MASK_INVALID_DESCR_TYPE_Pos  SAXI_DMAC_CH_INTR_MASK_INVALID_DESCR_TYPE_Pos
#define AXI_DMAC_CH_INTR_MASK_INVALID_DESCR_TYPE_Msk  SAXI_DMAC_CH_INTR_MASK_INVALID_DESCR_TYPE_Msk
#define AXI_DMAC_CH_INTR_MASK_CURR_PTR_NULL_Pos       SAXI_DMAC_CH_INTR_MASK_CURR_PTR_NULL_Pos
#define AXI_DMAC_CH_INTR_MASK_CURR_PTR_NULL_Msk       SAXI_DMAC_CH_INTR_MASK_CURR_PTR_NULL_Msk
#define AXI_DMAC_CH_INTR_MASK_ACTIVE_CH_DISABLED_Pos  SAXI_DMAC_CH_INTR_MASK_ACTIVE_CH_DISABLED_Pos
#define AXI_DMAC_CH_INTR_MASK_ACTIVE_CH_DISABLED_Msk  SAXI_DMAC_CH_INTR_MASK_ACTIVE_CH_DISABLED_Msk
#define AXI_DMAC_CH_INTR_MASK_DESCR_BUS_ERROR_Pos     SAXI_DMAC_CH_INTR_MASK_DESCR_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASK_DESCR_BUS_ERROR_Msk     SAXI_DMAC_CH_INTR_MASK_DESCR_BUS_ERROR_Msk
/* SAXI_DMAC_CH.INTR_MASKED */
#define AXI_DMAC_CH_INTR_MASKED_COMPLETION_Pos          SAXI_DMAC_CH_INTR_MASKED_COMPLETION_Pos
#define AXI_DMAC_CH_INTR_MASKED_COMPLETION_Msk          SAXI_DMAC_CH_INTR_MASKED_COMPLETION_Msk
#define AXI_DMAC_CH_INTR_MASKED_SRC_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_MASKED_SRC_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASKED_SRC_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_MASKED_SRC_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_MASKED_DST_BUS_ERROR_Pos       SAXI_DMAC_CH_INTR_MASKED_DST_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASKED_DST_BUS_ERROR_Msk       SAXI_DMAC_CH_INTR_MASKED_DST_BUS_ERROR_Msk
#define AXI_DMAC_CH_INTR_MASKED_INVALID_DESCR_TYPE_Pos  SAXI_DMAC_CH_INTR_MASKED_INVALID_DESCR_TYPE_Pos
#define AXI_DMAC_CH_INTR_MASKED_INVALID_DESCR_TYPE_Msk  SAXI_DMAC_CH_INTR_MASKED_INVALID_DESCR_TYPE_Msk
#define AXI_DMAC_CH_INTR_MASKED_CURR_PTR_NULL_Pos       SAXI_DMAC_CH_INTR_MASKED_CURR_PTR_NULL_Pos
#define AXI_DMAC_CH_INTR_MASKED_CURR_PTR_NULL_Msk       SAXI_DMAC_CH_INTR_MASKED_CURR_PTR_NULL_Msk
#define AXI_DMAC_CH_INTR_MASKED_ACTIVE_CH_DISABLED_Pos  SAXI_DMAC_CH_INTR_MASKED_ACTIVE_CH_DISABLED_Pos
#define AXI_DMAC_CH_INTR_MASKED_ACTIVE_CH_DISABLED_Msk  SAXI_DMAC_CH_INTR_MASKED_ACTIVE_CH_DISABLED_Msk
#define AXI_DMAC_CH_INTR_MASKED_DESCR_BUS_ERROR_Pos     SAXI_DMAC_CH_INTR_MASKED_DESCR_BUS_ERROR_Pos
#define AXI_DMAC_CH_INTR_MASKED_DESCR_BUS_ERROR_Msk     SAXI_DMAC_CH_INTR_MASKED_DESCR_BUS_ERROR_Msk
/* SAXI_DMAC.CTL */
#define AXI_DMAC_CTL_ENABLED_Pos               SAXI_DMAC_CTL_ENABLED_Pos
#define AXI_DMAC_CTL_ENABLED_Msk               SAXI_DMAC_CTL_ENABLED_Msk
/* SAXI_DMAC.STATUS */
#define AXI_DMAC_STATUS_CH_EN_Pos              SAXI_DMAC_STATUS_CH_EN_Pos
#define AXI_DMAC_STATUS_CH_EN_Msk              SAXI_DMAC_STATUS_CH_EN_Msk
/* SAXI_DMAC.ACTIVE */
#define AXI_DMAC_ACTIVE_ACTIVE_Pos             SAXI_DMAC_ACTIVE_ACTIVE_Pos
#define AXI_DMAC_ACTIVE_ACTIVE_Msk             SAXI_DMAC_ACTIVE_ACTIVE_Msk

