PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                EFUSE
******************************************************************************/

#define EFUSE_CTL(base)                              (((EFUSE_Type *) (base))->CTL)
#define EFUSE_TEST(base)                             (((EFUSE_Type *) (base))->TEST)
#define EFUSE_CMD(base)                              (((EFUSE_Type *) (base))->CMD)
#define EFUSE_CONFIG(base)                           (((EFUSE_Type *) (base))->CONFIG)
#define EFUSE_SEQ_DEFAULT(base)                      (((EFUSE_Type *) (base))->SEQ_DEFAULT)
#define EFUSE_SEQ_READ_CTL_0(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_0)
#define EFUSE_SEQ_READ_CTL_1(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_1)
#define EFUSE_SEQ_READ_CTL_2(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_2)
#define EFUSE_SEQ_READ_CTL_3(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_3)
#define EFUSE_SEQ_READ_CTL_4(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_4)
#define EFUSE_SEQ_READ_CTL_5(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_5)
#define EFUSE_SEQ_READ_CTL_6(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_6)
#define EFUSE_SEQ_READ_CTL_7(base)                   (((EFUSE_Type *) (base))->SEQ_READ_CTL_7)
#define EFUSE_SEQ_PROGRAM_CTL_0(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_0)
#define EFUSE_SEQ_PROGRAM_CTL_1(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_1)
#define EFUSE_SEQ_PROGRAM_CTL_2(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_2)
#define EFUSE_SEQ_PROGRAM_CTL_3(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_3)
#define EFUSE_SEQ_PROGRAM_CTL_4(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_4)
#define EFUSE_SEQ_PROGRAM_CTL_5(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_5)
#define EFUSE_SEQ_PROGRAM_CTL_6(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_6)
#define EFUSE_SEQ_PROGRAM_CTL_7(base)                (((EFUSE_Type *) (base))->SEQ_PROGRAM_CTL_7)
#define EFUSE_BOOTROW(base)                          (((EFUSE_Type *) (base))->BOOTROW)

/*******************************************************************************
*                FAULT
*******************************************************************************/

#define FAULT_CTL(base)                         (((FAULT_STRUCT_Type *)(base))->CTL)
#define FAULT_STATUS(base)                      (((FAULT_STRUCT_Type *)(base))->STATUS)
#define FAULT_DATA(base)                        (((FAULT_STRUCT_Type *)(base))->DATA)
#define FAULT_PENDING0(base)                    (((FAULT_STRUCT_Type *)(base))->PENDING0)
#define FAULT_PENDING1(base)                    (((FAULT_STRUCT_Type *)(base))->PENDING1)
#define FAULT_PENDING2(base)                    (((FAULT_STRUCT_Type *)(base))->PENDING2)
#define FAULT_MASK0(base)                       (((FAULT_STRUCT_Type *)(base))->MASK0)
#define FAULT_MASK1(base)                       (((FAULT_STRUCT_Type *)(base))->MASK1)
#define FAULT_MASK2(base)                       (((FAULT_STRUCT_Type *)(base))->MASK2)
#define FAULT_INTR(base)                        (((FAULT_STRUCT_Type *)(base))->INTR)
#define FAULT_INTR_SET(base)                    (((FAULT_STRUCT_Type *)(base))->INTR_SET)
#define FAULT_INTR_MASK(base)                   (((FAULT_STRUCT_Type *)(base))->INTR_MASK)
#define FAULT_INTR_MASKED(base)                 (((FAULT_STRUCT_Type *)(base))->INTR_MASKED)

/*******************************************************************************
*                PROFILE
*******************************************************************************/


#define CY_EP_MONITOR_COUNT                 ((uint32_t)(cy_device->epMonitorNr))
#define CY_EP_CNT_NR                        (8UL)
#define PROFILE_CTL                         (((PROFILE_Type*) PROFILE_BASE)->CTL)
#define PROFILE_STATUS                      (((PROFILE_Type*) PROFILE_BASE)->STATUS)
#define PROFILE_CMD                         (((PROFILE_Type*) PROFILE_BASE)->CMD)
#define PROFILE_INTR                        (((PROFILE_Type*) PROFILE_BASE)->INTR)
#define PROFILE_INTR_MASK                   (((PROFILE_Type*) PROFILE_BASE)->INTR_MASK)
#define PROFILE_INTR_MASKED                 (((PROFILE_Type*) PROFILE_BASE)->INTR_MASKED)
#define PROFILE_CNT_STRUCT                  (((PROFILE_Type*) PROFILE_BASE)->CNT_STRUCT)

/*******************************************************************************
*                SRSS
*******************************************************************************/

#define CY_SRSS_NUM_CLKPATH                 SRSS_NUM_CLKPATH
#define CY_SRSS_NUM_PLL                     SRSS_NUM_TOTAL_DPLL
#define CY_SRSS_NUM_HFROOT                  SRSS_NUM_HFROOT
#define CY_SRSS_ECO_PRESENT                 SRSS_ECO_PRESENT
#if defined(SRSS_FLL_PRESENT)
    #define CY_SRSS_FLL_PRESENT                 SRSS_FLL_PRESENT
#endif /* defined (SRSS_FLL_PRESENT) */
#define CY_SRSS_PLL_PRESENT                 SRSS_NUM_TOTAL_DPLL
#if defined (SRSS_ALTHF_PRESENT)
    #define CY_SRSS_ALTHF_PRESENT               SRSS_ALTHF_PRESENT
#endif /* defined SRSS_ALTHF_PRESENT */
#define CY_SRSS_PILO_PRESENT                SRSS_PILO_PRESENT
#define CY_SRSS_PLL400M_PRESENT             0
#define CY_SRSS_PLL200M_PRESENT             0
#define CY_SRSS_NUM_PLL400M                 0
#define CY_SRSS_DPLL_LP_PRESENT             SRSS_NUM_DPLL_LP
#define CY_SRSS_DPLL_HP_PRESENT             SRSS_NUM_DPLL_HP

#define CY_SRSS_IHO_PRESENT                 1
#define CY_SRSS_IMO_PRESENT                 SRSS_IMO_PRESENT
#define CY_SRSS_ILO_PRESENT                 SRSS_ILO_PRESENT

#define CY_SRSS_MFO_PRESENT                 0

#define SRSS_DPLL_LP_0_PATH_NUM  (0UL)
#define SRSS_DPLL_LP_1_PATH_NUM  (1UL)
#define SRSS_DPLL_HP_0_PATH_NUM  (2UL)

#define SRSS_DPLL_LP_FRAC_BIT_COUNT (24ULL)
#define SRSS_DPLL_HP_FRAC_BIT_COUNT (21ULL)

#define SRSS_DPLL_LP_INIT_DELAY_USEC (20U)
/** HF PATH # used for PERI PCLK */
#define CY_SYSCLK_CLK_PERI_HF_PATH_NUM     10U

/** HF PATH # used for Core */
#ifdef CORE_NAME_CM33_0
    #define CY_SYSCLK_CLK_CORE_HF_PATH_NUM     0U
#else
    #define CY_SYSCLK_CLK_CORE_HF_PATH_NUM     1U
#endif

/* HF PATH # Max Allowed Frequencies */
#define CY_SYSCLK_MAX_FREQ_HF0             200000000U
#define CY_SYSCLK_MAX_FREQ_HF1_3_4         400000000U
#define CY_SYSCLK_MAX_FREQ_HF2             300000000U
#define CY_SYSCLK_MAX_FREQ_HF5_6           208000000U
#define CY_SYSCLK_MAX_FREQ_HF7_9_10        100000000U
#define CY_SYSCLK_MAX_FREQ_HF8              50000000U
#define CY_SYSCLK_MAX_FREQ_HF12             64000000U
#define CY_SYSCLK_MAX_FREQ_HF13            125000000U

#define CY_SYSCLK_HF_MAX_FREQ(hfNum)     (((hfNum) == 0U) ? (CY_SYSCLK_MAX_FREQ_HF0) : \
                                          (((hfNum) == 1U || (hfNum) == 3U || (hfNum) == 4U) ? (CY_SYSCLK_MAX_FREQ_HF1_3_4) : \
                                          (((hfNum) == 2U) ? (CY_SYSCLK_MAX_FREQ_HF2) : \
                                          (((hfNum) == 5U || (hfNum) == 6U) ? (CY_SYSCLK_MAX_FREQ_HF5_6) : \
                                          (((hfNum) == 7U || (hfNum) == 9U || (hfNum) == 10U) ? (CY_SYSCLK_MAX_FREQ_HF7_9_10) : \
                                          (((hfNum) == 8U) ? (CY_SYSCLK_MAX_FREQ_HF8) : \
                                          (((hfNum) == 12U) ? (CY_SYSCLK_MAX_FREQ_HF12) : \
                                          (((hfNum) == 13U) ? (CY_SYSCLK_MAX_FREQ_HF13) : \
                                          (200000000U)))))))))


/* CAT1D specific macro redefinition */
/* CLK_ECO.CONFIG */
#define SRSS_CLK_ECO_CONFIG_ECO_DIV_DISABLE_Pos      CLK_ECO_CONFIG_ECO_DIV_DISABLE_Pos
#define SRSS_CLK_ECO_CONFIG_ECO_DIV_DISABLE_Msk      CLK_ECO_CONFIG_ECO_DIV_DISABLE_Msk
#define SRSS_CLK_ECO_CONFIG_ECO_DIV_ENABLE_Pos       CLK_ECO_CONFIG_ECO_DIV_ENABLE_Pos
#define SRSS_CLK_ECO_CONFIG_ECO_DIV_ENABLE_Msk       CLK_ECO_CONFIG_ECO_DIV_ENABLE_Msk
#define SRSS_CLK_ECO_CONFIG_ECO_EN_Msk               CLK_ECO_CONFIG_ECO_EN_Msk
/* CLK_ECO.CONFIG2 */
#define SRSS_CLK_ECO_CONFIG2_ECO_TRIM_CL_Msk          CLK_ECO_CONFIG2_ECO_TRIM_CL_Msk
#define SRSS_CLK_ECO_CONFIG2_ECO_TRIM_CL_Pos          CLK_ECO_CONFIG2_ECO_TRIM_CL_Pos
#define SRSS_CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Pos        CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Pos
#define SRSS_CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Msk        CLK_ECO_CONFIG2_ECO_TRIM_GAIN_Msk
#define SRSS_CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Pos    CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Pos
#define SRSS_CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Msk    CLK_ECO_CONFIG2_ECO_CTRL_AMPDETEN_Msk

/* CLK_ECO.STATUS */
#define SRSS_CLK_ECO_STATUS_ECO_OK_Pos      CLK_ECO_STATUS_ECO_OK_Pos
#define SRSS_CLK_ECO_STATUS_ECO_OK_Msk      CLK_ECO_STATUS_ECO_OK_Msk
#define SRSS_CLK_ECO_STATUS_ECO_READY_Pos   CLK_ECO_STATUS_ECO_READY_Pos
#define SRSS_CLK_ECO_STATUS_ECO_READY_Msk   CLK_ECO_STATUS_ECO_READY_Msk

/* Technology Independant Register set */
#define SRSS_CLK_DSI_SELECT                 (((SRSS_Type *) SRSS)->CLK_DSI_SELECT)
#define SRSS_CLK_OUTPUT_FAST                (((SRSS_Type *) SRSS)->CLK_OUTPUT_FAST)
#define SRSS_CLK_OUTPUT_SLOW                (((SRSS_Type *) SRSS)->CLK_OUTPUT_SLOW)
#define SRSS_CLK_CAL_CNT1                   (((SRSS_Type *) SRSS)->CLK_CAL_CNT1)
#define SRSS_CLK_CAL_CNT2                   (((SRSS_Type *) SRSS)->CLK_CAL_CNT2)
#define SRSS_SRSS_INTR                      (((SRSS_Type *) SRSS)->SRSS_INTR)
#define SRSS_SRSS_INTR_SET                  (((SRSS_Type *) SRSS)->SRSS_INTR_SET)
#define SRSS_SRSS_INTR_MASK                 (((SRSS_Type *) SRSS)->SRSS_INTR_MASK)
#define SRSS_SRSS_INTR_MASKED               (((SRSS_Type *) SRSS)->SRSS_INTR_MASKED)
#define SRSS_SRSS_AINTR                     (((SRSS_Type *) SRSS)->SRSS_AINTR)
#define SRSS_SRSS_AINTR_SET                 (((SRSS_Type *) SRSS)->SRSS_AINTR_SET)
#define SRSS_SRSS_AINTR_MASK                (((SRSS_Type *) SRSS)->SRSS_AINTR_MASK)
#define SRSS_SRSS_AINTR_MASKED              (((SRSS_Type *) SRSS)->SRSS_AINTR_MASKED)
#define SRSS_PWR_CTL                        (((SRSS_Type *) SRSS)->PWR_CTL)
#define SRSS_PWR_CTL2                       (((SRSS_Type *) SRSS)->PWR_CTL2)
#define SRSS_PWR_HIBERNATE                  (((SRSS_Type *) SRSS)->PWR_HIBERNATE)
#define SRSS_PWR_CTL3                       (((SRSS_Type *) SRSS)->PWR_CTL3)
#define SRSS_PWR_STATUS                     (((SRSS_Type *) SRSS)->PWR_STATUS)
#define SRSS_PWR_HIB_DATA                   (((SRSS_Type *) SRSS)->PWR_HIB_DATA)
#define SRSS_CLK_PATH_SELECT                (((SRSS_Type *) SRSS)->CLK_PATH_SELECT)
#define SRSS_CLK_ROOT_SELECT                (((SRSS_Type *) SRSS)->CLK_ROOT_SELECT)
#define SRSS_CLK_DIRECT_SELECT              (((SRSS_Type *) SRSS)->CLK_DIRECT_SELECT)
#define SRSS_CLK_ECO_STATUS                 (((SRSS_Type *) SRSS)->CLK_ECO_STRUCT.STATUS)
#define SRSS_CLK_ILO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ILO_CONFIG)
#define SRSS_CLK_TRIM_ILO_CTL               (((SRSS_Type *) SRSS)->CLK_TRIM_ILO_CTL)
#define SRSS_CLK_PILO_CONFIG                (((SRSS_Type *) SRSS)->CLK_PILO_CONFIG)
#define SRSS_CLK_ECO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_ECO_STRUCT.CONFIG)
#define SRSS_CLK_ECO_CONFIG2                (((SRSS_Type *) SRSS)->CLK_ECO_STRUCT.CONFIG2)
#define SRSS_CLK_TRIM_ECO_CTL               (((SRSS_Type *) SRSS)->CLK_TRIM_ECO_CTL)
#define SRSS_CLK_MFO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_MFO_CONFIG)
#define SRSS_CLK_IHO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_IHO_CONFIG)
#define SRSS_CLK_ALTHF_CTL                  (((SRSS_Type *) SRSS)->CLK_ALTHF_CTL)

#define SRSS_CSV_HF_STRUCT                  (((SRSS_Type *) SRSS)->CSV_HF)
#define SRSS_CLK_SELECT                     (((SRSS_Type *) SRSS)->CLK_SELECT)
#define SRSS_CLK_TIMER_CTL                  (((SRSS_Type *) SRSS)->CLK_TIMER_CTL)
#define SRSS_CLK_IMO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_IMO_CONFIG)
#define SRSS_CLK_ECO_PRESCALE               (((SRSS_Type *) SRSS)->CLK_ECO_PRESCALE)
#define SRSS_CLK_MF_SELECT                  (((SRSS_Type *) SRSS)->CLK_MF_SELECT)
#define SRSS_CSV_REF_SEL                    (((SRSS_Type *) SRSS)->CSV_REF_SEL)
#define SRSS_CSV_REF                        (((SRSS_Type *) SRSS)->CSV_REF)
#define SRSS_CSV_LF_STRUCT                  (((SRSS_Type *) SRSS)->CSV_LF)
#define SRSS_CSV_LF_REF_SEL                 (((SRSS_Type *) SRSS)->CSV_LF_REF_SEL)
#define SRSS_CSV_ILO                        (((SRSS_Type *) SRSS)->CSV_ILO)
#define SRSS_RES_CAUSE                      (((SRSS_Type *) SRSS)->RES_CAUSE)
#define SRSS_RES_CAUSE2                     (((SRSS_Type *) SRSS)->RES_CAUSE2)
#define SRSS_RES_CAUSE_EXTEND               (((SRSS_Type *) SRSS)->RES_CAUSE_EXTEND)
#define SRSS_PWR_CBUCK_CTL                  (((SRSS_Type *) SRSS)->PWR_CBUCK_CTL)
#define SRSS_PWR_CBUCK_CTL2                 (((SRSS_Type *) SRSS)->PWR_CBUCK_CTL2)
#define SRSS_PWR_CBUCK_DPSLP_CTL            (((SRSS_Type *) SRSS)->PWR_CBUCK_DPSLP_CTL)
#define SRSS_PWR_CBUCK_STATUS               (((SRSS_Type *) SRSS)->PWR_CBUCK_STATUS)
#define SRSS_PWR_SDR0_CTL                   (((SRSS_Type *) SRSS)->PWR_SDR0_CTL)
#define SRSS_PWR_SDR1_CTL                   (((SRSS_Type *) SRSS)->PWR_SDR1_CTL)
#define SRSS_PWR_HVLDO0_CTL                 (((SRSS_Type *) SRSS)->PWR_HVLDO0_CTL)
#define SRSS_CLK_DPLL_LP                    (((SRSS_Type *) SRSS)->CLK_DPLL_LP)
#define SRSS_CLK_DPLL_HP                    (((SRSS_Type *) SRSS)->CLK_DPLL_HP)
#define SRSS_PWR_RETLDO_CTL                 (((SRSS_Type *) SRSS)->PWR_RETLDO_CTL)
#define SRSS_PWR_SRAMLDO_CTL                (((SRSS_Type *) SRSS)->PWR_SRAMLDO_CTL)
#define SRSS_PWR_MISCLDO_CTL                (((SRSS_Type *) SRSS)->PWR_MISCLDO_CTL)

