PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
#define SRSS_DECODED_LCS_DATA               (((SRSS_Type *) SRSS)->DECODED_LCS_DATA)

#define SRSS_CLK_LP_PLL                     (((SRSS_Type *) SRSS)->CLK_LP_PLL)
#define SRSS_CLK_IHO                        (((SRSS_Type *) SRSS)->CLK_IHO)
#define SRSS_TST_XRES_SECURE                (((SRSS_Type *) SRSS)->TST_XRES_SECURE)
#define SRSS_RES_PXRES_CTL                  (((SRSS_Type *) SRSS)->RES_PXRES_CTL)
#define SRSS_WDT_CTL                        (((SRSS_Type *) SRSS)->WDT_CTL)
#define SRSS_WDT_CNT                        (((SRSS_Type *) SRSS)->WDT_CNT)
#define SRSS_WDT_MATCH                      (((SRSS_Type *) SRSS)->WDT_MATCH)
#define SRSS_WDT_MATCH2                      (((SRSS_Type *) SRSS)->WDT_MATCH2)

#define SRSS_PWR_LVD_CTL                    (((SRSS_Type *) SRSS)->PWR_LVD_CTL)
#define SRSS_PWR_LVD_STATUS                 (((SRSS_Type *) SRSS)->PWR_LVD_STATUS)

#define SRSS_PWR_HIB_WAKE_CTL               (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL)
#define SRSS_PWR_HIB_WAKE_CTL2              (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL2)
#define SRSS_PWR_HIB_WAKE_CAUSE             (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CAUSE)
#define SRSS_RES_SOFT_CTL                   (((SRSS_Type *) SRSS)->RES_SOFT_CTL)


#define SRSS_TST_DDFT_FAST_CTL_REG          (*(volatile uint32_t *)(SRSS_BASE + 0x1104U))
#define SRSS_TST_DDFT_SLOW_CTL_REG          (*(volatile uint32_t *)(SRSS_BASE + 0x1108U))

#define SRSS_TST_DDFT_SLOW_CTL_MASK         (0x00001F1EU)
#define SRSS_TST_DDFT_FAST_CTL_MASK         (62U)

#define SRSS_CLK_DPLL_LP_CONFIG(pllNum)     (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG)
#define SRSS_CLK_DPLL_LP_CONFIG2(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG2)
#define SRSS_CLK_DPLL_LP_CONFIG3(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG3)
#define SRSS_CLK_DPLL_LP_CONFIG4(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG4)
#define SRSS_CLK_DPLL_LP_CONFIG5(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG5)
#if CY_IP_MXS22SRSS_VERSION_MINOR == (1u)
    #define SRSS_CLK_DPLL_LP_CONFIG6(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG6)
    #define SRSS_CLK_DPLL_LP_CONFIG7(pllNum)    (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].CONFIG7)
#endif
#define SRSS_CLK_DPLL_LP_STATUS(pllNum)     (((SRSS_Type *) SRSS)->CLK_DPLL_LP[pllNum].STATUS)

#define SRSS_CLK_DPLL_HP_CONFIG(pllNum)         (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].CONFIG)
#define SRSS_CLK_DPLL_HP_CONFIG2(pllNum)        (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].CONFIG2)
#define SRSS_CLK_DPLL_HP_CONFIG3(pllNum)        (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].CONFIG3)
#define SRSS_CLK_DPLL_HP_CONFIG4(pllNum)        (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].CONFIG4)
#define SRSS_CLK_DPLL_HP_CONFIG5(pllNum)        (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].CONFIG5)
#define SRSS_CLK_DPLL_HP_TRIGMOD(pllNum)        (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].TRIGMOD)
#define SRSS_CLK_DPLL_HP_TRIGMOD2(pllNum)       (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].TRIGMOD2)
#define SRSS_CLK_DPLL_HP_STATUS(pllNum)         (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].STATUS)
#define SRSS_CLK_DPLL_HP_DUTYCAL_CTRL(pllNum)   (((SRSS_Type *) SRSS)->CLK_DPLL_HP[pllNum].DUTYCAL_CTRL)


#define SRSS_TRIM_RAM_CTL(index)                ((RAM_TRIM_Type*) &SRSS->RAM_TRIM_STRUCT)->TRIM_RAM_CTL[index]

#define SRSS_CSV_HF_CSV_REF_CTL(hf)             (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].REF_CTL)
#define SRSS_CSV_HF_CSV_REF_LIMIT(hf)           (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].REF_LIMIT)
#define SRSS_CSV_HF_CSV_MON_CTL(hf)             (((SRSS_Type *) SRSS)->CSV_HF_STRUCT.CSV[hf].MON_CTL)

#define SRSS_CSV_LF_CSV_REF_CTL                 (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.REF_CTL)
#define SRSS_CSV_LF_CSV_REF_LIMIT               (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.REF_LIMIT)
#define SRSS_CSV_LF_CSV_MON_CTL                 (((SRSS_Type *) SRSS)->CSV_LF_STRUCT.CSV.MON_CTL)
/*******************************************************************************
*                PERI
*******************************************************************************/
/*******************************************************************************
*                PERI PCLK
*******************************************************************************/

#define PERI_INSTANCE_COUNT                    (2U)

#ifndef PERI_PCLK0_BASE
    #define PERI_PCLK0_BASE     PERI_PCLK_BASE
#endif

#ifndef PERI_PCLK1_BASE
    #define PERI_PCLK1_BASE     0U
#endif

#define PERI_PCLK_PERI_NUM_Msk                 (0x000000FFU)
#define PERI_PCLK_GR_NUM_Msk                   (0x0000FF00U)
#define PERI_PCLK_GR_NUM_Pos                   (8U)
#define PERI_PCLK_PERIPHERAL_GROUP_NUM         (1UL << PERI_PCLK_GR_NUM_Pos)
#define PERI_PCLK_INST_NUM_Msk                 (0x00FF0000U)
#define PERI_PCLK_INST_NUM_Pos                 (16U)

#define PERI_PCLK_GR_NUM(instNum)              (((instNum) == 0U)? PERI0_PCLK_GROUP_NR : PERI1_PCLK_GROUP_NR)

#define PERI_PCLK1_OFFSET                      (PERI_PCLK1_BASE - PERI_PCLK0_BASE)
#define PERI_PCLK_REG_BASE(instNum)            ((PERI_PCLK_Type*)(PERI_PCLK0_BASE + ((instNum) * PERI_PCLK1_OFFSET)))

#define PERI_DIV_8_CTL(instNum, grNum, divNum)                   ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->DIV_8_CTL[divNum]
#define PERI_DIV_16_CTL(instNum, grNum, divNum)                  ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->DIV_16_CTL[divNum]
#define PERI_DIV_16_5_CTL(instNum, grNum, divNum)                ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->DIV_16_5_CTL[divNum]
#define PERI_DIV_24_5_CTL(instNum, grNum, divNum)                ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->DIV_24_5_CTL[divNum]
#define PERI_CLOCK_CTL(instNum, grNum, periNum)                  ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->CLOCK_CTL[periNum]
#define PERI_DIV_CMD(instNum, grNum)                             ((PERI_PCLK_GR_Type*) &PERI_PCLK_REG_BASE(instNum)->GR[grNum])->DIV_CMD

