PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
__STATIC_INLINE uint32_t PERI_PCLK_GR_DIV_8_NR(uint32_t instNum, uint32_t grNum)
{
    uint32_t divider_num = 0U;
    switch (instNum)
    {
    case 0:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_8_VECT;
            break;
        case 1:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_8_VECT;
            break;
        case 2:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_8_VECT;
            break;
        case 3:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_8_VECT;
            break;
        case 4:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_8_VECT;
            break;
        case 5:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_8_VECT;
            break;
        case 6:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR6_GR_DIV_8_VECT;
            break;
        case 7:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR7_GR_DIV_8_VECT;
            break;
        case 8:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR8_GR_DIV_8_VECT;
            break;
        case 9:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR9_GR_DIV_8_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    case 1:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_8_VECT;
            break;
        case 1:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_8_VECT;
            break;
        case 2:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_8_VECT;
            break;
        case 3:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_8_VECT;
            break;
        case 4:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_8_VECT;
            break;
        case 5:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_8_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    default: /* Unsupported instance number */
        break;
    }
    return     divider_num;
}
__STATIC_INLINE uint32_t PERI_PCLK_GR_DIV_16_NR(uint32_t instNum, uint32_t grNum)
{
    uint32_t divider_num = 0U;
    switch (instNum)
    {
    case 0:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_16_VECT;
            break;
        case 1:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_16_VECT;
            break;
        case 2:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_16_VECT;
            break;
        case 3:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_16_VECT;
            break;
        case 4:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_16_VECT;
            break;
        case 5:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_16_VECT;
            break;
        case 6:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR6_GR_DIV_16_VECT;
            break;
        case 7:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR7_GR_DIV_16_VECT;
            break;
        case 8:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR8_GR_DIV_16_VECT;
            break;
        case 9:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR9_GR_DIV_16_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    case 1:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_16_VECT;
            break;
        case 1:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_16_VECT;
            break;
        case 2:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_16_VECT;
            break;
        case 3:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_16_VECT;
            break;
        case 4:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_16_VECT;
            break;
        case 5:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_16_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    default: /* Unsupported instance number */
        break;
    }
    return divider_num;
}
__STATIC_INLINE uint32_t PERI_PCLK_GR_DIV_16_5_NR(uint32_t instNum, uint32_t grNum)
{
    uint32_t divider_num = 0U;
    switch (instNum)
    {
    case 0:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_16_5_VECT;
            break;
        case 1:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_16_5_VECT;
            break;
        case 2:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_16_5_VECT;
            break;
        case 3:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_16_5_VECT;
            break;
        case 4:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_16_5_VECT;
            break;
        case 5:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_16_5_VECT;
            break;
        case 6:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR6_GR_DIV_16_5_VECT;
            break;
        case 7:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR7_GR_DIV_16_5_VECT;
            break;
        case 8:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR8_GR_DIV_16_5_VECT;
            break;
        case 9:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR9_GR_DIV_16_5_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    case 1:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_16_5_VECT;
            break;
        case 1:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_16_5_VECT;
            break;
        case 2:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_16_5_VECT;
            break;
        case 3:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_16_5_VECT;
            break;
        case 4:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_16_5_VECT;
            break;
        case 5:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_16_5_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    default: /* Unsupported instance number */
        break;
    }
    return     divider_num;
}
__STATIC_INLINE uint32_t PERI_PCLK_GR_DIV_24_5_NR(uint32_t instNum, uint32_t grNum)
{
    uint32_t divider_num = 0U;
    switch (instNum)
    {
    case 0:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_24_5_VECT;
            break;
        case 1:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_24_5_VECT;
            break;
        case 2:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_24_5_VECT;
            break;
        case 3:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_24_5_VECT;
            break;
        case 4:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_24_5_VECT;
            break;
        case 5:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_24_5_VECT;
            break;
        case 6:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR6_GR_DIV_24_5_VECT;
            break;
        case 7:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR7_GR_DIV_24_5_VECT;
            break;
        case 8:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR8_GR_DIV_24_5_VECT;
            break;
        case 9:
            divider_num = PERI0_PERI_PCLK_PCLK_GROUP_NR9_GR_DIV_24_5_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    case 1:
    {
        switch (grNum)
        {
        case 0:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR0_GR_DIV_24_5_VECT;
            break;
        case 1:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR1_GR_DIV_24_5_VECT;
            break;
        case 2:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR2_GR_DIV_24_5_VECT;
            break;
        case 3:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR3_GR_DIV_24_5_VECT;
            break;
        case 4:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR4_GR_DIV_24_5_VECT;
            break;
        case 5:
            divider_num = PERI1_PERI_PCLK_PCLK_GROUP_NR5_GR_DIV_24_5_VECT;
            break;
        default: /* Unsupported grp number */
            break;
        }
    }
    break;
    default: /* Unsupported      instance number */
        break;
    }
    return     divider_num;
}

/* PERI_PCLK_GR.DIV_CMD */
#define CY_PERI_DIV_CMD_DIV_SEL_Pos             PERI_PCLK_GR_DIV_CMD_DIV_SEL_Pos
#define CY_PERI_DIV_CMD_DIV_SEL_Msk             PERI_PCLK_GR_DIV_CMD_DIV_SEL_Msk
#define CY_PERI_DIV_CMD_TYPE_SEL_Pos            PERI_PCLK_GR_DIV_CMD_TYPE_SEL_Pos
#define CY_PERI_DIV_CMD_TYPE_SEL_Msk            PERI_PCLK_GR_DIV_CMD_TYPE_SEL_Msk
#define CY_PERI_DIV_CMD_PA_DIV_SEL_Pos          PERI_PCLK_GR_DIV_CMD_PA_DIV_SEL_Pos
#define CY_PERI_DIV_CMD_PA_DIV_SEL_Msk          PERI_PCLK_GR_DIV_CMD_PA_DIV_SEL_Msk
#define CY_PERI_DIV_CMD_PA_TYPE_SEL_Pos         PERI_PCLK_GR_DIV_CMD_PA_TYPE_SEL_Pos
#define CY_PERI_DIV_CMD_PA_TYPE_SEL_Msk         PERI_PCLK_GR_DIV_CMD_PA_TYPE_SEL_Msk
#define CY_PERI_DIV_CMD_DISABLE_Pos             PERI_PCLK_GR_DIV_CMD_DISABLE_Pos
#define CY_PERI_DIV_CMD_DISABLE_Msk             PERI_PCLK_GR_DIV_CMD_DISABLE_Msk
#define CY_PERI_DIV_CMD_ENABLE_Pos              PERI_PCLK_GR_DIV_CMD_ENABLE_Pos
#define CY_PERI_DIV_CMD_ENABLE_Msk              PERI_PCLK_GR_DIV_CMD_ENABLE_Msk


#define PERI_DIV_CMD_DIV_SEL_Pos                PERI_PCLK_GR_DIV_CMD_DIV_SEL_Pos
#define PERI_DIV_CMD_DIV_SEL_Msk                PERI_PCLK_GR_DIV_CMD_DIV_SEL_Msk
#define PERI_DIV_CMD_TYPE_SEL_Pos               PERI_PCLK_GR_DIV_CMD_TYPE_SEL_Pos
#define PERI_DIV_CMD_TYPE_SEL_Msk               PERI_PCLK_GR_DIV_CMD_TYPE_SEL_Msk
#define PERI_DIV_CMD_PA_DIV_SEL_Pos             PERI_PCLK_GR_DIV_CMD_PA_DIV_SEL_Pos
#define PERI_DIV_CMD_PA_DIV_SEL_Msk             PERI_PCLK_GR_DIV_CMD_PA_DIV_SEL_Msk
#define PERI_DIV_CMD_PA_TYPE_SEL_Pos            PERI_PCLK_GR_DIV_CMD_PA_TYPE_SEL_Pos
#define PERI_DIV_CMD_PA_TYPE_SEL_Msk            PERI_PCLK_GR_DIV_CMD_PA_TYPE_SEL_Msk
#define PERI_DIV_CMD_DISABLE_Pos                PERI_PCLK_GR_DIV_CMD_DISABLE_Pos
#define PERI_DIV_CMD_DISABLE_Msk                PERI_PCLK_GR_DIV_CMD_DISABLE_Msk
#define PERI_DIV_CMD_ENABLE_Pos                 PERI_PCLK_GR_DIV_CMD_ENABLE_Pos
#define PERI_DIV_CMD_ENABLE_Msk                 PERI_PCLK_GR_DIV_CMD_ENABLE_Msk

/* PERI_PCLK_GR.CLOCK_CTL */
#define CY_PERI_CLOCK_CTL_DIV_SEL_Pos           PERI_PCLK_GR_CLOCK_CTL_DIV_SEL_Pos
#define CY_PERI_CLOCK_CTL_DIV_SEL_Msk           PERI_PCLK_GR_CLOCK_CTL_DIV_SEL_Msk
#define CY_PERI_CLOCK_CTL_TYPE_SEL_Pos          PERI_PCLK_GR_CLOCK_CTL_TYPE_SEL_Pos
#define CY_PERI_CLOCK_CTL_TYPE_SEL_Msk          PERI_PCLK_GR_CLOCK_CTL_TYPE_SEL_Msk
/* PERI.DIV_8_CTL */
#define PERI_DIV_8_CTL_EN_Pos                   PERI_PCLK_GR_DIV_8_CTL_EN_Pos
#define PERI_DIV_8_CTL_EN_Msk                   PERI_PCLK_GR_DIV_8_CTL_EN_Msk
#define PERI_DIV_8_CTL_INT8_DIV_Pos             PERI_PCLK_GR_DIV_8_CTL_INT8_DIV_Pos
#define PERI_DIV_8_CTL_INT8_DIV_Msk             PERI_PCLK_GR_DIV_8_CTL_INT8_DIV_Msk
/* PERI.DIV_16_CTL */
#define PERI_DIV_16_CTL_EN_Pos                  PERI_PCLK_GR_DIV_16_CTL_EN_Pos
#define PERI_DIV_16_CTL_EN_Msk                  PERI_PCLK_GR_DIV_16_CTL_EN_Msk
#define PERI_DIV_16_CTL_INT16_DIV_Pos           PERI_PCLK_GR_DIV_16_CTL_INT16_DIV_Pos
#define PERI_DIV_16_CTL_INT16_DIV_Msk           PERI_PCLK_GR_DIV_16_CTL_INT16_DIV_Msk
/* PERI.DIV_16_5_CTL */
#define PERI_DIV_16_5_CTL_EN_Pos                PERI_PCLK_GR_DIV_16_5_CTL_EN_Pos
#define PERI_DIV_16_5_CTL_EN_Msk                PERI_PCLK_GR_DIV_16_5_CTL_EN_Msk
#define PERI_DIV_16_5_CTL_FRAC5_DIV_Pos         PERI_PCLK_GR_DIV_16_5_CTL_FRAC5_DIV_Pos
#define PERI_DIV_16_5_CTL_FRAC5_DIV_Msk         PERI_PCLK_GR_DIV_16_5_CTL_FRAC5_DIV_Msk
#define PERI_DIV_16_5_CTL_INT16_DIV_Pos         PERI_PCLK_GR_DIV_16_5_CTL_INT16_DIV_Pos
#define PERI_DIV_16_5_CTL_INT16_DIV_Msk         PERI_PCLK_GR_DIV_16_5_CTL_INT16_DIV_Msk
/* PERI.DIV_24_5_CTL */
#define PERI_DIV_24_5_CTL_EN_Pos                PERI_PCLK_GR_DIV_24_5_CTL_EN_Pos
#define PERI_DIV_24_5_CTL_EN_Msk                PERI_PCLK_GR_DIV_24_5_CTL_EN_Msk
#define PERI_DIV_24_5_CTL_FRAC5_DIV_Pos         PERI_PCLK_GR_DIV_24_5_CTL_FRAC5_DIV_Pos
#define PERI_DIV_24_5_CTL_FRAC5_DIV_Msk         PERI_PCLK_GR_DIV_24_5_CTL_FRAC5_DIV_Msk
#define PERI_DIV_24_5_CTL_INT24_DIV_Pos         PERI_PCLK_GR_DIV_24_5_CTL_INT24_DIV_Pos
#define PERI_DIV_24_5_CTL_INT24_DIV_Msk         PERI_PCLK_GR_DIV_24_5_CTL_INT24_DIV_Msk

