PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                PERI-GROUP
*******************************************************************************/
#define CY_PERI_GROUP_NR                        6

#ifndef PERI0_BASE
    #define PERI0_BASE PERI_BASE
#endif

#ifndef PERI1_BASE
    #define PERI1_BASE 0U
#endif


#define PERI_GR_OFFSET                      (PERI1_BASE - PERI0_BASE)
#define PERI_GR_REG_BASE(instNum)           ((PERI_Type*)(PERI0_BASE + ((instNum) * PERI_GR_OFFSET)))

#define PERI_GR_INST_NUM_Msk                 (0x0000FF00U)
#define PERI_GR_INST_NUM_Pos                 (8U)


#define PERI_GR_CLOCK_CTL(instNum, grNum)   ((PERI_GR_Type*) &PERI_GR_REG_BASE(instNum)->GR[grNum])->CLOCK_CTL
#define PERI_GR_SL_CTL(instNum, grNum)      ((PERI_GR_Type*) &PERI_GR_REG_BASE(instNum)->GR[grNum])->SL_CTL
#define PERI_GR_SL_CTL2(instNum, grNum)     ((PERI_GR_Type*) &PERI_GR_REG_BASE(instNum)->GR[grNum])->SL_CTL2
#define PERI_GR_SL_CTL3(instNum, grNum)     ((PERI_GR_Type*) &PERI_GR_REG_BASE(instNum)->GR[grNum])->SL_CTL3

/* CLK_HF* to PERI PCLK Group Mapping */
#define PERI0_PCLK_GR_NUM_0_CLK_HF_NUM              (0U)
#define PERI0_PCLK_GR_NUM_1_CLK_HF_NUM              (10U)
#define PERI0_PCLK_GR_NUM_2_CLK_HF_NUM              (9U)
#define PERI0_PCLK_GR_NUM_3_CLK_HF_NUM              (5U)
#define PERI0_PCLK_GR_NUM_4_CLK_HF_NUM              (6U)
#define PERI0_PCLK_GR_NUM_5_CLK_HF_NUM              (10U)
#define PERI0_PCLK_GR_NUM_6_CLK_HF_NUM              (13U)
#define PERI0_PCLK_GR_NUM_7_CLK_HF_NUM              (1U)
#define PERI0_PCLK_GR_NUM_8_CLK_HF_NUM              (11U)
#define PERI0_PCLK_GR_NUM_9_CLK_HF_NUM              (13U)


#define PERI1_PCLK_GR_NUM_0_CLK_HF_NUM              (1U)
#define PERI1_PCLK_GR_NUM_1_CLK_HF_NUM              (7U)
#define PERI1_PCLK_GR_NUM_2_CLK_HF_NUM              (5U)
#define PERI1_PCLK_GR_NUM_3_CLK_HF_NUM              (6U)
#define PERI1_PCLK_GR_NUM_4_CLK_HF_NUM              (0U)
#define PERI1_PCLK_GR_NUM_5_CLK_HF_NUM              (2U)



/*******************************************************************************
*         PERI-TR
*******************************************************************************/

#define PERI_TR_CMD                         (((PERI_Type*) (PERI0_BASE))->TR_CMD)
#define PERI1_TR_CMD                         (((PERI_Type*) (PERI1_BASE))->TR_CMD)
#define PERI_TR_GR_TR_CTL(group, trCtl)     (*(volatile uint32_t*) ((uint32_t)PERI0_BASE+ (uint32_t)offsetof(PERI_Type,TR_GR) + \
                                            ((group) * (uint32_t)sizeof(PERI_TR_GR_Type)) + \
                                            ((trCtl) * (uint32_t)sizeof(uint32_t))))
#define PERI1_TR_GR_TR_CTL(group, trCtl)     (*(volatile uint32_t*) ((uint32_t)PERI1_BASE+ (uint32_t)offsetof(PERI_Type,TR_GR) + \
                                            ((group) * (uint32_t)sizeof(PERI_TR_GR_Type)) + \
                                            ((trCtl) * (uint32_t)sizeof(uint32_t))))

#if defined (CY_IP_MXSPERI)
    #define PERI_TR_GR_TR_OUT_CTL_TR_SEL_Msk PERI_TR_GR_TR_CTL_TR_SEL_Msk
    #define PERI_TR_GR_TR_OUT_CTL_TR_SEL_Pos PERI_TR_GR_TR_CTL_TR_SEL_Pos
    #define CY_PERI_TR_CTL_SEL_Msk PERI_TR_GR_TR_CTL_TR_SEL_Msk
    #define CY_PERI_TR_CTL_SEL_Pos PERI_TR_GR_TR_CTL_TR_SEL_Pos
    #define PERI_V2_TR_CMD_OUT_SEL_Msk PERI_TR_CMD_OUT_SEL_Msk
    #define PERI_V2_TR_CMD_OUT_SEL_Pos PERI_TR_CMD_OUT_SEL_Pos
    #define PERI_V2_TR_CMD_GROUP_SEL_Msk PERI_TR_CMD_GROUP_SEL_Msk
    #define PERI_V2_TR_CMD_GROUP_SEL_Pos PERI_TR_CMD_GROUP_SEL_Pos
    #define CY_PERI_TR_CMD_GROUP_SEL_Msk PERI_TR_CMD_GROUP_SEL_Msk
    #define CY_PERI_TR_CMD_GROUP_SEL_Pos PERI_TR_CMD_GROUP_SEL_Pos
    #define CY_PERI_TR_CTL_SEL PERI_TR_GR_TR_CTL_TR_SEL
    #define PERI_TR_GR_TR_OUT_CTL_TR_INV_Msk PERI_TR_GR_TR_CTL_TR_INV_Msk
    #define PERI_TR_GR_TR_OUT_CTL_TR_INV_Pos PERI_TR_GR_TR_CTL_TR_INV_Pos
    #define PERI_TR_GR_TR_OUT_CTL_TR_EDGE_Msk PERI_TR_GR_TR_CTL_TR_EDGE_Msk
    #define PERI_TR_GR_TR_OUT_CTL_TR_EDGE_Pos PERI_TR_GR_TR_CTL_TR_EDGE_Pos
    #define PERI_V2_TR_CMD_TR_EDGE_Msk PERI_TR_CMD_TR_EDGE_Msk
    #define PERI_V2_TR_CMD_TR_EDGE_Pos PERI_TR_CMD_TR_EDGE_Pos
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_INV_Msk PERI_TR_1TO1_GR_TR_CTL_TR_INV_Msk
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_INV_Pos PERI_TR_1TO1_GR_TR_CTL_TR_INV_Pos
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_EDGE_Msk PERI_TR_1TO1_GR_TR_CTL_TR_EDGE_Msk
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_EDGE_Pos PERI_TR_1TO1_GR_TR_CTL_TR_EDGE_Pos
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_SEL_Msk PERI_TR_1TO1_GR_TR_CTL_TR_SEL_Msk
    #define PERI_TR_1TO1_GR_V2_TR_CTL_TR_SEL_Pos PERI_TR_1TO1_GR_TR_CTL_TR_SEL_Pos
    #define PERI_TR_GR_V2_TR_CTL_DBG_FREEZE_EN_Msk PERI_TR_GR_TR_CTL_DBG_FREEZE_EN_Msk
    #define PERI_TR_GR_V2_TR_CTL_DBG_FREEZE_EN_Pos PERI_TR_GR_TR_CTL_DBG_FREEZE_EN_Pos
    #define CY_PERI_V1 0U
    #define PERI_TR_CMD_COUNT_Pos 0UL
    #define PERI_TR_CMD_COUNT_Msk 0UL

    #if (CY_IP_MXSPERI_INSTANCES == 2U)
        #define PERI_INSTANCE_1_IDENT_Pos 16UL
        #define PERI_INSTANCE_1_IDENT_Msk 0x10000UL
    #endif /* CY_IP_MXSPERI_INSTANCES == 2U */

#endif /* CY_IP_MXSPERI */


#define CY_SYSPM_BOOTROM_ENTRYPOINT_ADDR        ((uint32_t)(&BACKUP_BREG_SET1[0])) /* Boot ROM will check this address for locating the entry point after Warm Boot */
#define CY_SYSPM_BOOTROM_DSRAM_DBG_ENABLE_MASK  0x00000001U


/*******************************************************************************
*                MXCM33
*******************************************************************************/
#define MXCM33_CM33_NMI_CTL(nmi)              (((volatile uint32_t *) (MXCM33->CM33_NMI_CTL))[(nmi)])
#define CM55_0_CPU_EVENT                      (0xFU)

/*******************************************************************************
*                MXCM55
*******************************************************************************/
#define MXCM55_CM55_NMI_CTL(nmi)              (((volatile uint32_t *) (MXCM55->CM55_NMI_CTL))[(nmi)])
#define CM33_0_CPU_EVENT                      (0xFU)

