PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                M0SECCPUSS
*******************************************************************************/
#define M0SECCPUSS_CLK_SYNC_CTL                (((M0SECCPUSS_Type*) M0SECCPUSS_BASE)->CLK_SYNC_CTL)
#define M0SECCPUSS_CM0_MS_PC                   (((M0SECCPUSS_Type*) M0SECCPUSS_BASE)->CM0_MS_PC)

/*******************************************************************************
*                MCWDT
*******************************************************************************/

#define MCWDT_CNTLOW(base)      (((MCWDT_STRUCT_Type *)(base))->MCWDT_CNTLOW)
#define MCWDT_CNTHIGH(base)     (((MCWDT_STRUCT_Type *)(base))->MCWDT_CNTHIGH)
#define MCWDT_MATCH(base)       (((MCWDT_STRUCT_Type *)(base))->MCWDT_MATCH)
#define MCWDT_CONFIG(base)      (((MCWDT_STRUCT_Type *)(base))->MCWDT_CONFIG)
#define MCWDT_CTL(base)         (((MCWDT_STRUCT_Type *)(base))->MCWDT_CTL)
#define MCWDT_INTR(base)        (((MCWDT_STRUCT_Type *)(base))->MCWDT_INTR)
#define MCWDT_INTR_SET(base)    (((MCWDT_STRUCT_Type *)(base))->MCWDT_INTR_SET)
#define MCWDT_INTR_MASK(base)   (((MCWDT_STRUCT_Type *)(base))->MCWDT_INTR_MASK)
#define MCWDT_INTR_MASKED(base) (((MCWDT_STRUCT_Type *)(base))->MCWDT_INTR_MASKED)
#define MCWDT_LOCK(base)        (((MCWDT_STRUCT_Type *)(base))->MCWDT_LOCK)
#define MCWDT_LOWER_LIMIT(base) (((MCWDT_STRUCT_Type *)(base))->MCWDT_LOWER_LIMIT)

/*******************************************************************************
*                CPUSS
*******************************************************************************/
#if defined (CORE_NAME_CM55_0)
    #define CPUSS_SYSTICK_NS_CTL                (((APPCPUSS_Type*) APPCPUSS_BASE)->SYSTICK_NS_CTL)
    #define CPUSS_SYSTICK_S_CTL                 (((APPCPUSS_Type*) APPCPUSS_BASE)->SYSTICK_S_CTL)
    #define CPUSS_PRODUCT_ID                    (((APPCPUSS_Type*) APPCPUSS_BASE)->PRODUCT_ID)
#else
    #define CPUSS_SYSTICK_NS_CTL                (((CPUSS_Type*) CPUSS_BASE)->SYSTICK_NS_CTL)
    #define CPUSS_SYSTICK_S_CTL                 (((CPUSS_Type*) CPUSS_BASE)->SYSTICK_S_CTL)
    #define CPUSS_TRIM_ROM_CTL                  (((CPUSS_Type*) CPUSS_BASE)->TRIM_ROM_CTL)
    #define CPUSS_PRODUCT_ID                    (((CPUSS_Type*) CPUSS_BASE)->PRODUCT_ID)
#endif

/* ARM core registers */
#define SYSTICK_CTRL                        (((SysTick_Type *)SysTick)->CTRL)
#define SYSTICK_LOAD                        (((SysTick_Type *)SysTick)->LOAD)
#define SYSTICK_VAL                         (((SysTick_Type *)SysTick)->VAL)
#define SYSTICK_NS_CTRL                     (((SysTick_Type *)SysTick_NS)->CTRL)
#define SYSTICK_NS_LOAD                     (((SysTick_Type *)SysTick_NS)->LOAD)
#define SYSTICK_NS_VAL                      (((SysTick_Type *)SysTick_NS)->VAL)
#define SCB_SCR                             (((SCB_Type *)SCB)->SCR)
#define SCB_CPACR                           (((SCB_Type *)SCB)->CPACR)

#define __CMSIS_VERSION_5_9 ((5 << 16U) | 9)
#define __CMSIS_VERSION_6_0 ((6 << 16U) | 0)

#if (__CM_CMSIS_VERSION >= __CMSIS_VERSION_6_0)

    #if defined (CORE_NAME_CM33_0)
        #define SCS_CPPWR                           (((SCnSCB_Type *)SCnSCB)->CPPWR)
        #define SCS_CPPWR_SU10_Msk                  (0x100000U)
        #define SCB_NS_CPACR_CP10_CP11_ENABLE      (0xFUL << 20u)
    #elif defined (CORE_NAME_CM55_0)
        #define SCS_CPPWR                           (((ICB_Type *)ICB)->CPPWR)
        #define SCS_CPPWR_SU10_Msk                  (0x100000U)
        #define SCB_NS_CPACR_CP10_CP11_ENABLE      (0xFUL << 20u)
    #endif

#else
    #if defined (CORE_NAME_CM33_0) || defined (CORE_NAME_CM55_0)
        #define SCS_CPPWR                           (((SCnSCB_Type *)SCnSCB)->CPPWR)
        #define SCS_CPPWR_SU10_Msk                  (0x100000U)
        #define SCB_NS_CPACR_CP10_CP11_ENABLE      (0xFUL << 20u)
    #elif defined (CORE_NAME_CM55_0)
    #endif

#endif //__CM_CMSIS_VERSION

#if defined (CORE_NAME_CM55_0)
    #if (__CM_CMSIS_VERSION >= __CMSIS_VERSION_5_9)
        #define MEM_CTL_MSCR                        (((MemSysCtl_Type *)MEMSYSCTL)->MSCR)
        #define EWIC_EWCI_ASCR                      (((EWIC_Type *)EWIC)->EWIC_ASCR)
    #else
        /* Remove below when CMSIS versiongrater than 5.9 */
        #define MEMSYSCTL_MSCR_ICACTIVE_Pos        13U                                         /*!< MEMSYSCTL MSCR: ICACTIVE Position */
        #define MEMSYSCTL_MSCR_ICACTIVE_Msk        (0x1UL << MEMSYSCTL_MSCR_ICACTIVE_Pos)      /*!< MEMSYSCTL MSCR: ICACTIVE Mask */

        #define MEMSYSCTL_MSCR_DCACTIVE_Pos        12U                                         /*!< MEMSYSCTL MSCR: DCACTIVE Position */
        #define MEMSYSCTL_MSCR_DCACTIVE_Msk        (0x1UL << MEMSYSCTL_MSCR_DCACTIVE_Pos)      /*!< MEMSYSCTL MSCR: DCACTIVE Mask */

        /* EWIC Automatic Sequence Control (EWIC_ASCR) Register Definitions */
        #define EWIC_EWIC_ASCR_ASPU_Pos             1U                                         /*!< EWIC EWIC_ASCR: ASPU Position */
        #define EWIC_EWIC_ASCR_ASPU_Msk            (0x1UL << EWIC_EWIC_ASCR_ASPU_Pos)          /*!< EWIC EWIC_ASCR: ASPU Mask */

        #define MEM_CTL_MSCR                        (*(volatile uint32_t *)(0xE001E000U))
        #define EWIC_EWCI_ASCR                      (*(volatile uint32_t *)(0xE0047004U))
    #endif
#endif

/*******************************************************************************
*                LPCOMP
*******************************************************************************/

#define LPCOMP_CMP0_CTRL(base)              (((LPCOMP_Type *)(base))->CMP0_CTRL)
#define LPCOMP_CMP1_CTRL(base)              (((LPCOMP_Type *)(base))->CMP1_CTRL)
#define LPCOMP_CMP0_SW_CLEAR(base)          (((LPCOMP_Type *)(base))->CMP0_SW_CLEAR)
#define LPCOMP_CMP1_SW_CLEAR(base)          (((LPCOMP_Type *)(base))->CMP1_SW_CLEAR)
#define LPCOMP_CMP0_SW(base)                (((LPCOMP_Type *)(base))->CMP0_SW)
#define LPCOMP_CMP1_SW(base)                (((LPCOMP_Type *)(base))->CMP1_SW)
#define LPCOMP_STATUS(base)                 (((LPCOMP_Type *)(base))->STATUS)
#define LPCOMP_CONFIG(base)                 (((LPCOMP_Type *)(base))->CONFIG)
#define LPCOMP_INTR(base)                   (((LPCOMP_Type *)(base))->INTR)
#define LPCOMP_INTR_SET(base)               (((LPCOMP_Type *)(base))->INTR_SET)
#define LPCOMP_INTR_MASK(base)              (((LPCOMP_Type *)(base))->INTR_MASK)
#define LPCOMP_INTR_MASKED(base)            (((LPCOMP_Type *)(base))->INTR_MASKED)
#if defined (CY_IP_MXS22LPCOMP)
    #define LPCOMP_CMP0_OFFSET_TRIM(base)       (((LPCOMP_Type *)(base))->CMP0_OFFSET_TRIM)
    #define LPCOMP_CMP1_OFFSET_TRIM(base)       (((LPCOMP_Type *)(base))->CMP1_OFFSET_TRIM)
#endif


