PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                AUTANALOG INFRA
*******************************************************************************/

#define AUTANALOG_INFRA_CLOCK_PTC_LP_DIV(base)         (((INFRA_Type *)(base))->CLOCK_PTC_LP_DIV)
#define AUTANALOG_INFRA_CLOCK_DAC_LP_DIV(base, cfgIdx) (((INFRA_Type *)(base))->CLOCK_DAC_LP_DIV[cfgIdx])
#define AUTANALOG_INFRA_CLOCK_PRIO_HS_DIV(base)        (((INFRA_Type *)(base))->CLOCK_PRIO_HS_DIV)
#define AUTANALOG_INFRA_PRIO_CFG(base, cfgIdx)         (((INFRA_Type *)(base))->PRIO_CFG[cfgIdx])
#define AUTANALOG_INFRA_LPOSC_CFG(base)                (((INFRA_LPOSC_Type *) (&((INFRA_Type *)base)->LPOSC))->CFG)
#define AUTANALOG_INFRA_AREF_CTRL(base)                (((INFRA_AREF_Type *)  (&((INFRA_Type *)base)->AREF))->CTRL)
#define AUTANALOG_INFRA_PRB_VREF_CTRL(base, cfgIdx)    (((INFRA_PRB_Type *)   (&((INFRA_Type *)base)->PRB))->VREF_CTRL[cfgIdx])
#define AUTANALOG_INFRA_TIMER_CTRL(base)               (((INFRA_TIMER_Type *) (&((INFRA_Type *)base)->TIMER))->CTRL)
#define AUTANALOG_INFRA_TIMER_CFG(base)                (((INFRA_TIMER_Type *) (&((INFRA_Type *)base)->TIMER))->CFG)
#define AUTANALOG_INFRA_TIMER_PERIOD(base)             (((INFRA_TIMER_Type *) (&((INFRA_Type *)base)->TIMER))->PERIOD)


/*******************************************************************************
*                AUTANALOG AC
*******************************************************************************/

#define AUTANALOG_AC_CFG(base)                 (((ACTRLR_Type *)(base))->CFG)
#define AUTANALOG_AC_CTRL(base)                (((ACTRLR_Type *)(base))->CTRL)
#define AUTANALOG_AC_CMD_RUN(base)             (((ACTRLR_Type *)(base))->CMD_RUN)
#define AUTANALOG_AC_CMD_PAUSE(base)           (((ACTRLR_Type *)(base))->DEBUG_PAUSE)
#define AUTANALOG_AC_CMD_SINGLE_STEP(base)     (((ACTRLR_Type *)(base))->DEBUG_SINGLE_STEP)
#define AUTANALOG_AC_STATUS(base)              (((ACTRLR_Type *)(base))->STATUS)
#define AUTANALOG_AC_PWR_STATUS(base)          (((ACTRLR_Type *)(base))->PWR_STATUS)
#define AUTANALOG_AC_CNTR_STATUS(base, cntIdx) (((ACTRLR_Type *)(base))->CNTR_STATUS[cntIdx])
#define AUTANALOG_AC_CMD_STATE(base)           (((ACTRLR_Type *)(base))->CMD_STATE)
#define AUTANALOG_AC_FW_TR(base, triggIdx)     (((ACTRLR_Type *)(base))->FW_TR[triggIdx])
#define AUTANALOG_AC_TT_CFG0(base, stateIdx)   (((ACTRLR_TTCFG_Type *)(&((ACTRLR_Type *)base)->TTCFG[stateIdx]))->TT_CFG0)
#define AUTANALOG_AC_TT_CFG1(base, stateIdx)   (((ACTRLR_TTCFG_Type *)(&((ACTRLR_Type *)base)->TTCFG[stateIdx]))->TT_CFG1)
#define AUTANALOG_AC_TT_CFG2(base, stateIdx)   (((ACTRLR_TTCFG_Type *)(&((ACTRLR_Type *)base)->TTCFG[stateIdx]))->TT_CFG2)
#define AUTANALOG_AC_TT_CFG3(base, stateIdx)   (((ACTRLR_TTCFG_Type *)(&((ACTRLR_Type *)base)->TTCFG[stateIdx]))->TT_CFG3)
#define AUTANALOG_AC_TT_CFG4(base, stateIdx)   (((ACTRLR_TTCFG_Type *)(&((ACTRLR_Type *)base)->TTCFG[stateIdx]))->TT_CFG4)


/*******************************************************************************
*                AUTANALOG CTBL
*******************************************************************************/

#define AUTANALOG_CTBX_STA_CFG(base)         (((CTBL_STA_Type *)(&((CTBL_Type *)base)->STA))->CFG)
#define AUTANALOG_CTBX_DYN_CFG(base, cfgIdx) (((CTBL_DYN_Type *)(&((CTBL_Type *)base)->DYN[cfgIdx]))->OA_MUX_CFG)
#define AUTANALOG_CTBX_COMP_STATUS(base)     (((CTBL_STA_Type *)(&((CTBL_Type *)base)->STA))->COMP_STAT)


/*******************************************************************************
*                AUTANALOG PTC
*******************************************************************************/

#define AUTANALOG_PTC_STA_CFG(base)              (((PTC_STA_Type*)  (&((PTC_Type*) base)->STA))->CFG)
#define AUTANALOG_PTC_STA_PP_CFG(base, cfgIdx)   (((PTC_STA_Type*)  (&((PTC_Type*) base)->STA))->PP_CFG[cfgIdx])
#define AUTANALOG_PTC_COMP_STAT(base)            (((PTC_STA_Type*)  (&((PTC_Type*) base)->STA))->COMP_STAT)
#define AUTANALOG_PTC_DYN_CFG(base, cfgIdx)      (((PTC_DYN_Type*)  (&((PTC_Type*) base)->DYN[cfgIdx]))->MUX_CFG)
#define AUTANALOG_PTC_PP_CFG(base, cfgIdx)       (((PTC_PP_Type*)   (&((PTC_Type*) base)->PP[cfgIdx]))->CFG)
#define AUTANALOG_PTC_PP_FRAME(base, cfgIdx)     (((PTC_PP_Type*)   (&((PTC_Type*) base)->PP[cfgIdx]))->FRAME)
#define AUTANALOG_PTC_PP_WINDOW(base, cfgIdx)    (((PTC_PP_Type*)   (&((PTC_Type*) base)->PP[cfgIdx]))->WINDOW)
#define AUTANALOG_PTC_PP_THRESHOLD(base, cfgIdx) (((PTC_PP_Type*)   (&((PTC_Type*) base)->PP[cfgIdx]))->THRESHOLD)
#define AUTANALOG_PTC_TRIM_CMP0(base)            (((PTC_TRIM_Type*) (&((PTC_Type*) base)->TRIM))->CMP0_OFFSET_TRIM)
#define AUTANALOG_PTC_TRIM_CMP1(base)            (((PTC_TRIM_Type*) (&((PTC_Type*) base)->TRIM))->CMP1_OFFSET_TRIM)


/*******************************************************************************
*                AUTANALOG DAC
*******************************************************************************/

#define AUTANALOG_DAC_CTRL(base)                    (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->CTRL)
#define AUTANALOG_DAC_SAMPLE_TIME(base)             (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->SAMPLE_TIME)
#define AUTANALOG_DAC_STEP_VAL(base, cfgIdx)        (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->STEP_VAL[cfgIdx])
#define AUTANALOG_DAC_DEGLITCH_TIME(base)           (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->DEGLITCH_TIME)
#define AUTANALOG_DAC_CHAN_CFG(base, cfgIdx)        (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->CHAN_CFG[cfgIdx])
#define AUTANALOG_DAC_FW_DAC_VAL(base)              (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->FW_DAC_VAL)
#define AUTANALOG_DAC_FW_DAC_VAL_NXT(base)          (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->FW_DAC_VAL_NXT)
#define AUTANALOG_DAC_CHAN_STATUS_CFG(base, cfgIdx) (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->CHAN_STATUS_CFG[cfgIdx])
#define AUTANALOG_DAC_RANGE_STATUS(base)            (((DAC_STA_Type *) (&((DAC_Type *)base)->STA))->RANGE_STATUS)
#define AUTANALOG_DAC_LUT(base, lutIdx)             (((DAC_Type *)(base))->SRAM[lutIdx])


