PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                AUTANALOG SAR
*******************************************************************************/

#define AUTANALOG_SAR_SEQ_HS_DATA(base, cfgIdx)       (((SAR_Type *)(base))->SEQ_HS_DATA[cfgIdx])
#define AUTANALOG_SAR_SEQ_LP_DATA(base, cfgIdx)       (((SAR_Type *)(base))->SEQ_LP_DATA[cfgIdx])
#define AUTANALOG_SAR_CTRL(base)                      (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->CTRL)
#define AUTANALOG_SAR_FIR_CFG(base, cfgIdx)           (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->FIR_CFG[cfgIdx])
#define AUTANALOG_SAR_TR_SAMPLE_TIME(base)            (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->TR_SAMPLE_TIME)
#define AUTANALOG_SAR_SAMPLE_TIME(base, cfgIdx)       (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->SAMPLE_TIME[cfgIdx])
#define AUTANALOG_SAR_GPIO_CHAN_CFG(base, cfgIdx)     (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->GPIO_CHAN_CFG[cfgIdx])
#define AUTANALOG_SAR_MUX_CHAN_CFG(base, cfgIdx)      (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->MUX_CHAN_CFG[cfgIdx])
#define AUTANALOG_SAR_STATUS_CFG(base, cfgIdx)        (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->STATUS_CFG[cfgIdx])
#define AUTANALOG_SAR_STATUS_RANGE_LOW(base, cfgIdx)  (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->STATUS_RANGE_LOW[cfgIdx])
#define AUTANALOG_SAR_STATUS_RANGE_HIGH(base, cfgIdx) (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->STATUS_RANGE_HIGH[cfgIdx])
#define AUTANALOG_SAR_GPIO_CHAN_RESULT(base, ch)      (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->GPIO_CHAN_RESULT[ch])
#define AUTANALOG_SAR_MUX_CHAN_RESULT(base, ch)       (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->MUX_CHAN_RESULT[ch])
#define AUTANALOG_SAR_FIR_RESULT(base, firIdx)        (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->FIR_RESULT[firIdx])
#define AUTANALOG_SAR_CHAN_RESULT_MASK(base)          (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->CHAN_RESULT_MASK)
#define AUTANALOG_SAR_FIR_RESULT_MASK(base)           (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->FIR_RESULT_MASK)
#define AUTANALOG_SAR_CHAN_RESULT_STATUS(base)        (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->CHAN_RESULT_UPDATED)
#define AUTANALOG_SAR_FIR_RESULT_STATUS(base)         (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->FIR_RESULT_UPDATED)
#define AUTANALOG_SAR_STATUS(base)                    (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->STATUS)
#define AUTANALOG_SAR_RANGE_STATUS(base)              (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->RANGE_STATUS)
#define AUTANALOG_SAR_CHAN_COEFF(base, cfgIdx)        (((SAR_STA_Type *) (&((SAR_Type *)base)->STA))->CHAN_COEFF[cfgIdx])
#define AUTANALOG_SAR_FIR0_COEF(base, cfgIdx)         (((SAR_FIR0_Type *) (&((SAR_Type *)base)->FIR0))[cfgIdx].COEF)
#define AUTANALOG_SAR_FIR0_TAP(base, cfgIdx)          (((SAR_FIR0_Type *) (&((SAR_Type *)base)->FIR0))[cfgIdx].TAP)
#define AUTANALOG_SAR_FIR1_COEF(base, cfgIdx)         (((SAR_FIR1_Type *) (&((SAR_Type *)base)->FIR1))[cfgIdx].COEF)
#define AUTANALOG_SAR_FIR1_TAP(base, cfgIdx)          (((SAR_FIR1_Type *) (&((SAR_Type *)base)->FIR1))[cfgIdx].TAP)


/*******************************************************************************
*                AUTANALOG MMIO
*******************************************************************************/

#define AUTANALOG_MMIO_TR_OUT(base, triggIdx)          (((LPPASS_MMIO_Type *)(base))->TR_OUT[triggIdx])
#define AUTANALOG_MMIO_INTR_CAUSE(base)                (((LPPASS_MMIO_Type *)(base))->INTR_CAUSE)
#define AUTANALOG_MMIO_INTR(base)                      (((LPPASS_MMIO_Type *)(base))->INTR)
#define AUTANALOG_MMIO_INTR_SET(base)                  (((LPPASS_MMIO_Type *)(base))->INTR_SET)
#define AUTANALOG_MMIO_INTR_MASK(base)                 (((LPPASS_MMIO_Type *)(base))->INTR_MASK)
#define AUTANALOG_MMIO_INTR_MASKED(base)               (((LPPASS_MMIO_Type *)(base))->INTR_MASKED)
#define AUTANALOG_MMIO_FIFO_INTR_CAUSE(base)           (((LPPASS_MMIO_Type *)(base))->FIFO_INTR_CAUSE)
#define AUTANALOG_MMIO_FIFO_INTR(base)                 (((LPPASS_MMIO_Type *)(base))->FIFO_INTR)
#define AUTANALOG_MMIO_FIFO_INTR_SET(base)             (((LPPASS_MMIO_Type *)(base))->FIFO_INTR_SET)
#define AUTANALOG_MMIO_FIFO_INTR_MASK(base)            (((LPPASS_MMIO_Type *)(base))->FIFO_INTR_MASK)
#define AUTANALOG_MMIO_FIFO_INTR_MASKED(base)          (((LPPASS_MMIO_Type *)(base))->FIFO_INTR_MASKED)
#define AUTANALOG_MMIO_FIFO_STA_CFG(base)              (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->CFG)
#define AUTANALOG_MMIO_FIFO_STA_MODE(base)             (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->MODE)
#define AUTANALOG_MMIO_FIFO_STA_MODE_STATUS(base)      (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->MODE_STATUS)
#define AUTANALOG_MMIO_FIFO_STA_LEVEL(base, cfgIdx)    (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->LEVEL[cfgIdx])
#define AUTANALOG_MMIO_FIFO_STA_USED(base, buffIdx)    (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->USED[buffIdx])
#define AUTANALOG_MMIO_FIFO_STA_RD_DATA(base, buffIdx) (((LPPASS_MMIO_STA_Type *)(&((LPPASS_MMIO_Type *)base)->STA))->RD_DATA[buffIdx])


/*******************************************************************************
*                TCPWM
*******************************************************************************/

#define TCPWM_CTRL_SET(base)                (((TCPWM_Type *)(base))->CTRL_SET)
#define TCPWM_CTRL_CLR(base)                (((TCPWM_Type *)(base))->CTRL_CLR)
#define TCPWM_CMD_START(base)               (((TCPWM_Type *)(base))->CMD_START)
#define TCPWM_CMD_RELOAD(base)              (((TCPWM_Type *)(base))->CMD_RELOAD)
#define TCPWM_CMD_STOP(base)                (((TCPWM_Type *)(base))->CMD_STOP)
#define TCPWM_CMD_CAPTURE(base)             (((TCPWM_Type *)(base))->CMD_CAPTURE)

#define TCPWM_CNT_CTRL(base, cntNum)         (((TCPWM_Type *)(base))->CNT[cntNum].CTRL)
#define TCPWM_CNT_CC(base, cntNum)           (((TCPWM_Type *)(base))->CNT[cntNum].CC)
#define TCPWM_CNT_CC_BUFF(base, cntNum)      (((TCPWM_Type *)(base))->CNT[cntNum].CC_BUFF)
#define TCPWM_CNT_COUNTER(base, cntNum)      (((TCPWM_Type *)(base))->CNT[cntNum].COUNTER)
#define TCPWM_CNT_PERIOD(base, cntNum)       (((TCPWM_Type *)(base))->CNT[cntNum].PERIOD)
#define TCPWM_CNT_PERIOD_BUFF(base, cntNum)  (((TCPWM_Type *)(base))->CNT[cntNum].PERIOD_BUFF)
#define TCPWM_CNT_STATUS(base, cntNum)       (((TCPWM_Type *)(base))->CNT[cntNum].STATUS)
#define TCPWM_CNT_INTR(base, cntNum)         (((TCPWM_Type *)(base))->CNT[cntNum].INTR)
#define TCPWM_CNT_INTR_SET(base, cntNum)     (((TCPWM_Type *)(base))->CNT[cntNum].INTR_SET)
#define TCPWM_CNT_INTR_MASK(base, cntNum)    (((TCPWM_Type *)(base))->CNT[cntNum].INTR_MASK)
#define TCPWM_CNT_INTR_MASKED(base, cntNum)  (((TCPWM_Type *)(base))->CNT[cntNum].INTR_MASKED)
#define TCPWM_CNT_TR_CTRL0(base, cntNum)     (((TCPWM_Type *)(base))->CNT[cntNum].TR_CTRL0)
#define TCPWM_CNT_TR_CTRL1(base, cntNum)     (((TCPWM_Type *)(base))->CNT[cntNum].TR_CTRL1)
#define TCPWM_CNT_TR_CTRL2(base, cntNum)     (((TCPWM_Type *)(base))->CNT[cntNum].TR_CTRL2)

#define TCPWM_GRP_CC1_PRESENT_STATUS (TCPWM_GRP_NR0_CNT_GRP_CC1_PRESENT | TCPWM_GRP_NR1_CNT_GRP_CC1_PRESENT << 1)
#define TCPWM_GRP_AMC_PRESENT_STATUS (TCPWM_GRP_NR0_CNT_GRP_AMC_PRESENT | TCPWM_GRP_NR1_CNT_GRP_AMC_PRESENT << 1)
#define TCPWM_GRP_SMC_PRESENT_STATUS (TCPWM_GRP_NR0_CNT_GRP_SMC_PRESENT | TCPWM_GRP_NR1_CNT_GRP_SMC_PRESENT << 1)

#define TCPWM_GRP_CC1(base, grp) ((bool)((TCPWM_GRP_CC1_PRESENT_STATUS >> (grp)) & 0x01U))
#define TCPWM_GRP_AMC(base, grp) ((bool)((TCPWM_GRP_AMC_PRESENT_STATUS >> (grp)) & 0x01U))
#define TCPWM_GRP_SMC(base, grp) ((bool)((TCPWM_GRP_SMC_PRESENT_STATUS >> (grp)) & 0x01U))

#define TCPWM_GRP_CNT_GET_GRP(cntNum)        ((cntNum )/ 256U)

#define TCPWM_GRP_CNT_CTRL(base, grp, cntNum)           (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].CTRL)
#define TCPWM_GRP_CNT_STATUS(base, grp, cntNum)         (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].STATUS)
#define TCPWM_GRP_CNT_COUNTER(base, grp, cntNum)        (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].COUNTER)
#define TCPWM_GRP_CNT_CC0(base, grp, cntNum)            (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].CC0)
#define TCPWM_GRP_CNT_CC0_BUFF(base, grp, cntNum)       (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].CC0_BUFF)
#define TCPWM_GRP_CNT_CC1(base, grp, cntNum)            (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].CC1)
#define TCPWM_GRP_CNT_CC1_BUFF(base, grp, cntNum)       (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].CC1_BUFF)
#define TCPWM_GRP_CNT_PERIOD(base, grp, cntNum)         (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].PERIOD)
#define TCPWM_GRP_CNT_PERIOD_BUFF(base, grp, cntNum)    (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].PERIOD_BUFF)
#define TCPWM_GRP_CNT_LINE_SEL(base, grp, cntNum)       (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].LINE_SEL)
#define TCPWM_GRP_CNT_LINE_SEL_BUFF(base, grp, cntNum)  (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].LINE_SEL_BUFF)
#define TCPWM_GRP_CNT_DT(base, grp, cntNum)             (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].DT)
#define TCPWM_GRP_CNT_TR_CMD(base, grp, cntNum)         (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_CMD)
#define TCPWM_GRP_CNT_TR_IN_SEL0(base, grp, cntNum)     (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_IN_SEL0)
#define TCPWM_GRP_CNT_TR_IN_SEL1(base, grp, cntNum)     (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_IN_SEL1)
#define TCPWM_GRP_CNT_TR_IN_EDGE_SEL(base, grp, cntNum) (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_IN_EDGE_SEL)
#define TCPWM_GRP_CNT_TR_PWM_CTRL(base, grp, cntNum)    (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_PWM_CTRL)
#define TCPWM_GRP_CNT_TR_OUT_SEL(base, grp, cntNum)     (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].TR_OUT_SEL)
#define TCPWM_GRP_CNT_INTR(base, grp, cntNum)           (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].INTR)
#define TCPWM_GRP_CNT_INTR_SET(base, grp, cntNum)       (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].INTR_SET)
#define TCPWM_GRP_CNT_INTR_MASK(base, grp, cntNum)      (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].INTR_MASK)
#define TCPWM_GRP_CNT_INTR_MASKED(base, grp, cntNum)    (((TCPWM_Type *)(base))->GRP[grp].CNT[((cntNum) % 256U)].INTR_MASKED)

