PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                BACKUP
*******************************************************************************/

#define BACKUP_RESET                        (((RTC_Type *) RTC)->RESET)

#define BACKUP_RESET_RESET_Msk                 RTC_RESET_RESET_Msk
#define BACKUP_INTR_CENTURY_Msk                RTC_INTR_CENTURY_Msk
#define BACKUP_INTR_ALARM1_Msk                 RTC_INTR_ALARM1_Msk
#define BACKUP_INTR_ALARM2_Msk                 RTC_INTR_ALARM2_Msk
#define BACKUP_RTC_TIME_CTRL_12HR_Msk          RTC_RTC_TIME_CTRL_12HR_Msk
#define BACKUP_RTC_TIME_CTRL_12HR_Pos          RTC_RTC_TIME_CTRL_12HR_Pos
#define BACKUP_STATUS_RTC_BUSY_Msk             RTC_STATUS_RTC_BUSY_Msk
#define BACKUP_STATUS_RTC_BUSY_Pos            RTC_STATUS_RTC_BUSY_Pos
#define BACKUP_RTC_RW_WRITE_Msk                RTC_RTC_RW_WRITE_Msk
#define BACKUP_RTC_RW_WRITE_Pos                RTC_RTC_RW_WRITE_Pos
#define BACKUP_RTC_RW_READ_Msk                 RTC_RTC_RW_READ_Msk
#define BACKUP_RTC_RW_READ_Pos                 RTC_RTC_RW_READ_Pos
#define BACKUP_RTC_TIME_RTC_SEC_Msk            RTC_RTC_TIME_RTC_SEC_Msk
#define BACKUP_RTC_TIME_RTC_SEC_Pos            RTC_RTC_TIME_RTC_SEC_Pos
#define BACKUP_RTC_TIME_RTC_MIN_Msk            RTC_RTC_TIME_RTC_MIN_Msk
#define BACKUP_RTC_TIME_RTC_MIN_Pos            RTC_RTC_TIME_RTC_MIN_Pos
#define BACKUP_RTC_TIME_RTC_HOUR_Msk           RTC_RTC_TIME_RTC_HOUR_Msk
#define BACKUP_RTC_TIME_RTC_HOUR_Pos           RTC_RTC_TIME_RTC_HOUR_Pos
#define BACKUP_RTC_TIME_RTC_DAY_Msk            RTC_RTC_TIME_RTC_DAY_Msk
#define BACKUP_RTC_TIME_RTC_DAY_Pos            RTC_RTC_TIME_RTC_DAY_Pos
#define BACKUP_RTC_DATE_RTC_DATE_Msk           RTC_RTC_DATE_RTC_DATE_Msk
#define BACKUP_RTC_DATE_RTC_DATE_Pos           RTC_RTC_DATE_RTC_DATE_Pos
#define BACKUP_RTC_DATE_RTC_MON_Msk            RTC_RTC_DATE_RTC_MON_Msk
#define BACKUP_RTC_DATE_RTC_MON_Pos            RTC_RTC_DATE_RTC_MON_Pos
#define BACKUP_RTC_DATE_RTC_YEAR_Msk           RTC_RTC_DATE_RTC_YEAR_Msk
#define BACKUP_RTC_DATE_RTC_YEAR_Pos           RTC_RTC_DATE_RTC_YEAR_Pos
#define BACKUP_ALM1_TIME_ALM_SEC_Msk           RTC_ALM1_TIME_ALM_SEC_Msk
#define BACKUP_ALM1_TIME_ALM_SEC_Pos           RTC_ALM1_TIME_ALM_SEC_Pos
#define BACKUP_ALM1_TIME_ALM_SEC_EN_Msk        RTC_ALM1_TIME_ALM_SEC_EN_Msk
#define BACKUP_ALM1_TIME_ALM_SEC_EN_Pos        RTC_ALM1_TIME_ALM_SEC_EN_Pos
#define BACKUP_ALM1_TIME_ALM_MIN_Msk           RTC_ALM1_TIME_ALM_MIN_Msk
#define BACKUP_ALM1_TIME_ALM_MIN_Pos           RTC_ALM1_TIME_ALM_MIN_Pos
#define BACKUP_ALM1_TIME_ALM_MIN_EN_Msk        RTC_ALM1_TIME_ALM_MIN_EN_Msk
#define BACKUP_ALM1_TIME_ALM_MIN_EN_Pos        RTC_ALM1_TIME_ALM_MIN_EN_Pos
#define BACKUP_ALM1_TIME_ALM_HOUR_Msk          RTC_ALM1_TIME_ALM_HOUR_Msk
#define BACKUP_ALM1_TIME_ALM_HOUR_Pos          RTC_ALM1_TIME_ALM_HOUR_Pos
#define BACKUP_ALM1_TIME_ALM_HOUR_EN_Msk       RTC_ALM1_TIME_ALM_HOUR_EN_Msk
#define BACKUP_ALM1_TIME_ALM_HOUR_EN_Pos       RTC_ALM1_TIME_ALM_HOUR_EN_Pos
#define BACKUP_ALM1_TIME_ALM_DAY_Msk           RTC_ALM1_TIME_ALM_DAY_Msk
#define BACKUP_ALM1_TIME_ALM_DAY_Pos           RTC_ALM1_TIME_ALM_DAY_Pos
#define BACKUP_ALM1_TIME_ALM_DAY_EN_Msk        RTC_ALM1_TIME_ALM_DAY_EN_Msk
#define BACKUP_ALM1_TIME_ALM_DAY_EN_Pos        RTC_ALM1_TIME_ALM_DAY_EN_Pos
#define BACKUP_ALM1_DATE_ALM_EN_Msk            RTC_ALM1_DATE_ALM_EN_Msk
#define BACKUP_ALM1_DATE_ALM_EN_Pos            RTC_ALM1_DATE_ALM_EN_Pos
#define BACKUP_ALM1_DATE_ALM_DATE_Msk          RTC_ALM1_DATE_ALM_DATE_Msk
#define BACKUP_ALM1_DATE_ALM_DATE_Pos          RTC_ALM1_DATE_ALM_DATE_Pos
#define BACKUP_ALM1_DATE_ALM_DATE_EN_Msk       RTC_ALM1_DATE_ALM_DATE_EN_Msk
#define BACKUP_ALM1_DATE_ALM_DATE_EN_Pos       RTC_ALM1_DATE_ALM_DATE_EN_Pos
#define BACKUP_ALM1_DATE_ALM_MON_Msk           RTC_ALM1_DATE_ALM_MON_Msk
#define BACKUP_ALM1_DATE_ALM_MON_Pos           RTC_ALM1_DATE_ALM_MON_Pos
#define BACKUP_ALM1_DATE_ALM_MON_EN_Msk        RTC_ALM1_DATE_ALM_MON_EN_Msk
#define BACKUP_ALM1_DATE_ALM_MON_EN_Pos        RTC_ALM1_DATE_ALM_MON_EN_Pos
#define BACKUP_ALM1_DATE_ALM_YEAR_Msk          RTC_ALM1_DATE_ALM_YEAR_Msk
#define BACKUP_ALM1_DATE_ALM_YEAR_Pos          RTC_ALM1_DATE_ALM_YEAR_Pos
#define BACKUP_ALM1_DATE_ALM_YEAR_EN_Msk       RTC_ALM1_DATE_ALM_YEAR_EN_Msk
#define BACKUP_ALM1_DATE_ALM_YEAR_EN_Pos       RTC_ALM1_DATE_ALM_YEAR_EN_Pos
#define BACKUP_ALM2_TIME_ALM_SEC_Msk           RTC_ALM2_TIME_ALM_SEC_Msk
#define BACKUP_ALM2_TIME_ALM_SEC_Pos           RTC_ALM2_TIME_ALM_SEC_Pos
#define BACKUP_ALM2_TIME_ALM_SEC_EN_Msk        RTC_ALM2_TIME_ALM_SEC_EN_Msk
#define BACKUP_ALM2_TIME_ALM_SEC_EN_Pos        RTC_ALM2_TIME_ALM_SEC_EN_Pos
#define BACKUP_ALM2_TIME_ALM_MIN_Msk           RTC_ALM2_TIME_ALM_MIN_Msk
#define BACKUP_ALM2_TIME_ALM_MIN_Pos           RTC_ALM2_TIME_ALM_MIN_Pos
#define BACKUP_ALM2_TIME_ALM_MIN_EN_Msk        RTC_ALM2_TIME_ALM_MIN_EN_Msk
#define BACKUP_ALM2_TIME_ALM_MIN_EN_Pos        RTC_ALM2_TIME_ALM_MIN_EN_Pos
#define BACKUP_ALM2_TIME_ALM_HOUR_Msk          RTC_ALM2_TIME_ALM_HOUR_Msk
#define BACKUP_ALM2_TIME_ALM_HOUR_Pos          RTC_ALM2_TIME_ALM_HOUR_Pos
#define BACKUP_ALM2_TIME_ALM_HOUR_EN_Msk       RTC_ALM2_TIME_ALM_HOUR_EN_Msk
#define BACKUP_ALM2_TIME_ALM_HOUR_EN_Pos       RTC_ALM2_TIME_ALM_HOUR_EN_Pos
#define BACKUP_ALM2_TIME_ALM_DAY_Msk           RTC_ALM2_TIME_ALM_DAY_Msk
#define BACKUP_ALM2_TIME_ALM_DAY_Pos           RTC_ALM2_TIME_ALM_DAY_Pos
#define BACKUP_ALM2_TIME_ALM_DAY_EN_Msk        RTC_ALM2_TIME_ALM_DAY_EN_Msk
#define BACKUP_ALM2_TIME_ALM_DAY_EN_Pos        RTC_ALM2_TIME_ALM_DAY_EN_Pos
#define BACKUP_ALM2_DATE_ALM_EN_Msk            RTC_ALM2_DATE_ALM_EN_Msk
#define BACKUP_ALM2_DATE_ALM_EN_Pos            RTC_ALM2_DATE_ALM_EN_Pos
#define BACKUP_ALM2_DATE_ALM_EN_Msk            RTC_ALM2_DATE_ALM_EN_Msk
#define BACKUP_ALM2_DATE_ALM_EN_Pos            RTC_ALM2_DATE_ALM_EN_Pos
#define BACKUP_ALM2_DATE_ALM_DATE_Msk          RTC_ALM2_DATE_ALM_DATE_Msk
#define BACKUP_ALM2_DATE_ALM_DATE_Pos          RTC_ALM2_DATE_ALM_DATE_Pos
#define BACKUP_ALM2_DATE_ALM_DATE_EN_Msk       RTC_ALM2_DATE_ALM_DATE_EN_Msk
#define BACKUP_ALM2_DATE_ALM_DATE_EN_Pos       RTC_ALM2_DATE_ALM_DATE_EN_Pos
#define BACKUP_ALM2_DATE_ALM_MON_Msk           RTC_ALM2_DATE_ALM_MON_Msk
#define BACKUP_ALM2_DATE_ALM_MON_Pos           RTC_ALM2_DATE_ALM_MON_Pos
#define BACKUP_ALM2_DATE_ALM_MON_EN_Msk        RTC_ALM2_DATE_ALM_MON_EN_Msk
#define BACKUP_ALM2_DATE_ALM_MON_EN_Pos        RTC_ALM2_DATE_ALM_MON_EN_Pos
#define BACKUP_CAL_CTL_CALIB_VAL_Msk           RTC_CAL_CTL_CALIB_VAL_Msk
#define BACKUP_CAL_CTL_CALIB_VAL_Pos           RTC_CAL_CTL_CALIB_VAL_Pos
#define BACKUP_CAL_CTL_CALIB_SIGN_Msk          RTC_CAL_CTL_CALIB_SIGN_Msk
#define BACKUP_CAL_CTL_CALIB_SIGN_Pos          RTC_CAL_CTL_CALIB_SIGN_Pos
#define BACKUP_CAL_CTL_CAL_OUT_Msk             RTC_CAL_CTL_CAL_OUT_Msk
#define BACKUP_CAL_CTL_CAL_OUT_Pos             RTC_CAL_CTL_CAL_OUT_Pos
#define BACKUP_CAL_CTL_CAL_SEL_Msk             RTC_CAL_CTL_CAL_SEL_Msk
#define BACKUP_CAL_CTL_CAL_SEL_Pos             RTC_CAL_CTL_CAL_SEL_Pos

