PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
#define BACKUP_CTL                          (((SRSS_Type *) SRSS)->CLK_WCO_CONFIG)
#define BACKUP_RTC_RW                       (((RTC_Type *) RTC)->RTC_RW)
#define BACKUP_CAL_CTL                      (((RTC_Type *) RTC)->CAL_CTL)
#define BACKUP_STATUS                       (((RTC_Type *) RTC)->STATUS)
#define BACKUP_RTC_TIME                     (((RTC_Type *) RTC)->RTC_TIME)
#define BACKUP_RTC_DATE                     (((RTC_Type *) RTC)->RTC_DATE)
#define BACKUP_ALM1_TIME                    (((RTC_Type *) RTC)->ALM1_TIME)
#define BACKUP_ALM1_DATE                    (((RTC_Type *) RTC)->ALM1_DATE)
#define BACKUP_ALM2_TIME                    (((RTC_Type *) RTC)->ALM2_TIME)
#define BACKUP_ALM2_DATE                    (((RTC_Type *) RTC)->ALM2_DATE)
#define BACKUP_INTR                         (((RTC_Type *) RTC)->INTR)
#define BACKUP_INTR_SET                     (((RTC_Type *) RTC)->INTR_SET)
#define BACKUP_INTR_MASK                    (((RTC_Type *) RTC)->INTR_MASK)
#define BACKUP_INTR_MASKED                  (((RTC_Type *) RTC)->INTR_MASKED)
#define BACKUP_PMIC_CTL                     (((RTC_Type *) RTC)->PMIC_CTL)
#define BACKUP_RESET                        (((RTC_Type *) RTC)->RESET)
#define BACKUP_LPECO_CTL                    (((RTC_Type *) RTC)->LPECO_CTL)
#define BACKUP_LPECO_PRESCALE               (((RTC_Type *) RTC)->LPECO_PRESCALE)
#define BACKUP_LPECO_STATUS                 (((RTC_Type *) RTC)->LPECO_STATUS)
#define BACKUP_WCO_STATUS                   (((SRSS_Type *) SRSS)->CLK_WCO_STATUS)
#define BACKUP_BREG_SET0                    (((RTC_Type *) RTC)->BREG_SET0)
#define BACKUP_BREG_SET1                    (((RTC_Type *) RTC)->BREG_SET1)
#define BACKUP_BREG_SET2                    (((RTC_Type *) RTC)->BREG_SET2)
#define BACKUP_BREG_SET3                    (((RTC_Type *) RTC)->BREG_SET3)


#define CY_SRSS_BACKUP_NUM_BREG             (SRSS_RTC_NUM_BREG0 + SRSS_RTC_NUM_BREG1 + SRSS_RTC_NUM_BREG2 + SRSS_RTC_NUM_BREG3)
#define CY_SRSS_BACKUP_BREG0_START_POS      (0UL)
#define CY_SRSS_BACKUP_BREG1_START_POS      (SRSS_RTC_NUM_BREG0)
#define CY_SRSS_BACKUP_BREG2_START_POS      (SRSS_RTC_NUM_BREG0 + SRSS_RTC_NUM_BREG1)
#define CY_SRSS_BACKUP_BREG3_START_POS      (SRSS_RTC_NUM_BREG0 + SRSS_RTC_NUM_BREG1 + SRSS_RTC_NUM_BREG2)




/*******************************************************************************
*                CANFD
*******************************************************************************/

#define CANFD_CTL(base)                           (((CANFD_Type *)(base))->CTL)
#define CANFD_STATUS(base)                        (((CANFD_Type *)(base))->STATUS)
#define CANFD_NBTP(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.NBTP)
#define CANFD_IR(base, chan)                      (((CANFD_Type *)(base))->CH[chan].M_TTCAN.IR)
#define CANFD_IE(base, chan)                      (((CANFD_Type *)(base))->CH[chan].M_TTCAN.IE)
#define CANFD_ILS(base, chan)                     (((CANFD_Type *)(base))->CH[chan].M_TTCAN.ILS)
#define CANFD_ILE(base, chan)                     (((CANFD_Type *)(base))->CH[chan].M_TTCAN.ILE)
#define CANFD_CCCR(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.CCCR)
#define CANFD_SIDFC(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.SIDFC)
#define CANFD_XIDFC(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.XIDFC)
#define CANFD_XIDAM(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.XIDAM)
#define CANFD_RXESC(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXESC)
#define CANFD_RXF0C(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF0C)
#define CANFD_RXF1C(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF1C)
#define CANFD_RXFTOP_CTL(base, chan)              (((CANFD_Type *)(base))->CH[chan].RXFTOP_CTL)
#define CANFD_RXBC(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXBC)
#define CANFD_TXESC(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXESC)
#define CANFD_TXEFC(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXEFC)
#define CANFD_TXBC(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBC)
#define CANFD_DBTP(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.DBTP)
#define CANFD_TDCR(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TDCR)
#define CANFD_GFC(base, chan)                     (((CANFD_Type *)(base))->CH[chan].M_TTCAN.GFC)
#define CANFD_TXBRP(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBRP)
#define CANFD_TXBAR(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBAR)
#define CANFD_TXBCR(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBCR)
#define CANFD_TXBTO(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBTO)
#define CANFD_TXBCF(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBCF)
#define CANFD_TXBTIE(base, chan)                  (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBTIE)
#define CANFD_TXBCIE(base, chan)                  (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TXBCIE)
#define CANFD_NDAT1(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.NDAT1)
#define CANFD_NDAT2(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.NDAT2)
#define CANFD_RXF0S(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF0S)
#define CANFD_RXFTOP0_DATA(base, chan)            (((CANFD_Type *)(base))->CH[chan].RXFTOP0_DATA)
#define CANFD_RXFTOP1_DATA(base, chan)            (((CANFD_Type *)(base))->CH[chan].RXFTOP1_DATA)
#define CANFD_RXF0A(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF0A)
#define CANFD_RXF1S(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF1S)
#define CANFD_RXF1A(base, chan)                   (((CANFD_Type *)(base))->CH[chan].M_TTCAN.RXF1A)
#define CANFD_PSR(base, chan)                     (((CANFD_Type *)(base))->CH[chan].M_TTCAN.PSR)
#define CANFD_TEST(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.TEST)
#define CANFD_CREL(base, chan)                    (((CANFD_Type *)(base))->CH[chan].M_TTCAN.CREL)

#define CY_CANFD_CHANNELS_NUM                     (0x1UL)

