PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/******************************************************************************
*                MXETH
*******************************************************************************/

#define ETH_CTL(base)                       (((ETH_Type*)(base))->CTL)
#define ETH_TX_Q_PTR(base)                  (((ETH_Type*)(base))->TRANSMIT_Q_PTR)
#define ETH_TX_Q1_PTR(base)                 (((ETH_Type*)(base))->TRANSMIT_Q1_PTR)
#define ETH_TX_Q2_PTR(base)                 (((ETH_Type*)(base))->TRANSMIT_Q2_PTR)
#define ETH_RX_Q_PTR(base)                  (((ETH_Type*)(base))->RECEIVE_Q_PTR)
#define ETH_RX_Q1_PTR(base)                 (((ETH_Type*)(base))->RECEIVE_Q1_PTR)
#define ETH_RX_Q2_PTR(base)                 (((ETH_Type*)(base))->RECEIVE_Q2_PTR)

/*******************************************************************************
*                PPU
*******************************************************************************/
#define CY_PPU_PD0_BASE                              ((uint32_t)PWRMODE_PPU_MAIN)
#define CY_PPU_PD1_BASE                              ((uint32_t)PWRMODE_PPU_PD1)
#define CY_PPU_SRAM0_BASE                            ((uint32_t)RAMC_PPU0_BASE)
#define CY_PPU_SRAM1_BASE                            ((uint32_t)RAMC_PPU1_BASE)
#define CY_PPU_SYSCPU_BASE                           ((uint32_t)CPUSS_PPU_BASE)
#define CY_PPU_APPCPUSS_BASE                         ((uint32_t)PPU_APPCPUSS_BASE)
#define CY_PPU_APPCPU_BASE                           ((uint32_t)PPU_CM55_0_BASE)
#define CY_PPU_SOCMEM_BASE                           ((uint32_t)SOCMEM_PPU_SOCMEM)
#define CY_PPU_U55_BASE                              ((uint32_t)U550_MXU55_PPU )

/* Alias name for PD0 PPU */
#define CY_PPU_MAIN_BASE                             CY_PPU_PD0_BASE

/* PPU configurations for DEEPSLEEP */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE        PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_PD1_PPU_DEEPSLEEP_MODE         PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_SRAM0_PPU_DEEPSLEEP_MODE       PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_SRAM1_PPU_DEEPSLEEP_MODE       PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_SYSCPU_PPU_DEEPSLEEP_MODE      PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_MODE    PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_MODE      PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_SOCMEM_PPU_DEEPSLEEP_MODE      PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_U55_PPU_DEEPSLEEP_MODE         PPU_V1_MODE_OFF


/* PPU configurations for DEEPSLEEP-RAM */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE        PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_PD1_PPU_DEEPSLEEP_RAM_MODE         PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_SRAM0_PPU_DEEPSLEEP_RAM_MODE       PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_SRAM1_PPU_DEEPSLEEP_RAM_MODE       PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_SYSCPU_PPU_DEEPSLEEP_RAM_MODE      PPU_V1_MODE_OFF
#define CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_RAM_MODE    PPU_V1_MODE_OFF
#define CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_RAM_MODE      PPU_V1_MODE_OFF
#define CY_SYSTEM_SOCMEM_PPU_DEEPSLEEP_RAM_MODE      PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_U55_PPU_DEEPSLEEP_RAM_MODE         PPU_V1_MODE_OFF


/* PPU configurations for DEEPSLEEP-OFF */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE        PPU_V1_MODE_OFF
#define CY_SYSTEM_PD1_PPU_DEEPSLEEP_OFF_MODE         PPU_V1_MODE_OFF
#define CY_SYSTEM_SRAM0_PPU_DEEPSLEEP_OFF_MODE       PPU_V1_MODE_OFF
#define CY_SYSTEM_SRAM1_PPU_DEEPSLEEP_OFF_MODE       PPU_V1_MODE_OFF
#define CY_SYSTEM_SYSCPU_PPU_DEEPSLEEP_OFF_MODE      PPU_V1_MODE_OFF
#define CY_SYSTEM_APPCPUSS_PPU_DEEPSLEEP_OFF_MODE    PPU_V1_MODE_OFF
#define CY_SYSTEM_APPCPU_PPU_DEEPSLEEP_OFF_MODE      PPU_V1_MODE_OFF
#define CY_SYSTEM_SOCMEM_PPU_DEEPSLEEP_OFF_MODE      PPU_V1_MODE_OFF
#define CY_SYSTEM_U55_PPU_DEEPSLEEP_OFF_MODE         PPU_V1_MODE_OFF


/* System DEEPSLEEP Mode = (PPU_MAIN Mode)*/
#ifdef CORE_NAME_CM55_0
    #define CY_SYSTEM_DEEPSLEEP_PPU_MODES        (uint32_t)((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE | ((uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_MODE << 8U))
    #define CY_SYSTEM_DEEPSLEEP_RAM_PPU_MODES    (uint32_t)((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE | ((uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_RAM_MODE << 8U))
    #define CY_SYSTEM_DEEPSLEEP_OFF_PPU_MODES    (uint32_t)((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE | ((uint32_t)CY_SYSTEM_PD1_PPU_DEEPSLEEP_OFF_MODE << 8U))
#else
    #define CY_SYSTEM_DEEPSLEEP_PPU_MODES        ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE)
    #define CY_SYSTEM_DEEPSLEEP_RAM_PPU_MODES    ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE)
    #define CY_SYSTEM_DEEPSLEEP_OFF_PPU_MODES    ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE)
#endif



/*******************************************************************************
*                PDCM
*******************************************************************************/

#define CY_PDCM_PD_SENSE(pd_id)                        (((PWRMODE_PD_Type*) &PWRMODE->PD[pd_id])->PD_SENSE)
#define CY_PDCM_PD_SPT(pd_id)                          (((PWRMODE_PD_Type*) &PWRMODE->PD[pd_id])->PD_SPT)

/*******************************************************************************
*                PWRMODE
*******************************************************************************/

#define CY_PWRMODE_CLK_SELECT                          (((PWRMODE_Type*) PWRMODE_BASE)->CLK_SELECT)


/*******************************************************************************
*                IPC
*******************************************************************************/

#define REG_IPC_STRUCT_ACQUIRE(base)           (((IPC_STRUCT_Type*)(base))->ACQUIRE)
#define REG_IPC_STRUCT_RELEASE(base)           (((IPC_STRUCT_Type*)(base))->RELEASE)
#define REG_IPC_STRUCT_NOTIFY(base)            (((IPC_STRUCT_Type*)(base))->NOTIFY)
#define REG_IPC_STRUCT_DATA(base)              (((IPC_STRUCT_Type*)(base))->DATA0)
#define REG_IPC_STRUCT_DATA1(base)             (((IPC_STRUCT_Type*)(base))->DATA1)
#define REG_IPC_STRUCT_LOCK_STATUS(base)       (*(volatile uint32_t*)((uint32_t)(base) + offsetof(IPC_STRUCT_Type, LOCK_STATUS)))

#define REG_IPC_INTR_STRUCT_INTR(base)         (((IPC_INTR_STRUCT_Type*)(base))->INTR)
#define REG_IPC_INTR_STRUCT_INTR_SET(base)     (((IPC_INTR_STRUCT_Type*)(base))->INTR_SET)
#define REG_IPC_INTR_STRUCT_INTR_MASK(base)    (((IPC_INTR_STRUCT_Type*)(base))->INTR_MASK)
#define REG_IPC_INTR_STRUCT_INTR_MASKED(base)  (((IPC_INTR_STRUCT_Type*)(base))->INTR_MASKED)

