PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
#define CY_IPC_STRUCT_PTR_FOR_IP(ipcIndex, base)            ((IPC_STRUCT_Type*)((uint32_t)(base) + (sizeof(IPC_STRUCT_Type) * (ipcIndex))))
#define CY_IPC_INTR_STRUCT_PTR_FOR_IP(ipcIntrIndex, base)   (&(((IPC_Type *)(base))->INTR_STRUCT[(ipcIntrIndex)]))

#define CY_IPC_INSTANCES                       CY_IP_MXIPC_INSTANCES
#define CY_IPC_CHANNELS                        (CPUSS_IPC_NR + APPCPUSS_IPC_NR)
#define CY_IPC_CHANNELS_PER_INSTANCE           CPUSS_IPC_NR
#define CY_IPC_INTERRUPTS                      (CPUSS_IPC_IRQ_NR + APPCPUSS_IPC_IRQ_NR)
#define CY_IPC_INTERRUPTS_PER_INSTANCE         CPUSS_IPC_IRQ_NR
#define CY_IPC_IP0_CH                          CPUSS_IPC_NR
#define CY_IPC_IP0_INT                         CPUSS_IPC_IRQ_NR
#define CY_IPC_IP1_CH                          APPCPUSS_IPC_NR
#define CY_IPC_IP1_INT                         APPCPUSS_IPC_IRQ_NR
#define cpuss_interrupts_ipc_0_IRQn            m33syscpuss_interrupts_ipc_dpslp_0_IRQn
#define cpuss_interrupts_ipc_1_IRQn            m55appcpuss_interrupts_ipc_dpslp_0_IRQn

extern const uint32_t IPC_CHANNELS_NR[CY_IPC_INSTANCES];
extern const uint32_t IPC_IRQ_NR[CY_IPC_INSTANCES];
extern const uint32_t IPC_BASE_PTR[CY_IPC_INSTANCES];

#define CY_IPC_PIPE_IS_CHANNEL_INTR_COMBINATION_VALID(ipcChannel, ipcIntrIndex)  ((((ipcChannel) < CY_IPC_CHANNELS_PER_INSTANCE) && ((ipcIntrIndex) < CY_IPC_INTERRUPTS_PER_INSTANCE)) || \
                                                                                  (((ipcChannel) >= CY_IPC_CHANNELS_PER_INSTANCE) && ((ipcIntrIndex) >= CY_IPC_INTERRUPTS_PER_INSTANCE)))
#define CY_IPC_STRUCT_PTR(ipcIndex)                                              CY_IPC_STRUCT_PTR_FOR_IP(((ipcIndex)%CY_IPC_CHANNELS_PER_INSTANCE), IPC_BASE_PTR[((ipcIndex)-((ipcIndex)%CY_IPC_CHANNELS_PER_INSTANCE))/CY_IPC_CHANNELS_PER_INSTANCE])
#define CY_IPC_INTR_STRUCT_PTR(ipcIntrIndex)                                     CY_IPC_INTR_STRUCT_PTR_FOR_IP(((ipcIntrIndex)%CY_IPC_INTERRUPTS_PER_INSTANCE), IPC_BASE_PTR[((ipcIntrIndex)-((ipcIntrIndex)%CY_IPC_INTERRUPTS_PER_INSTANCE))/CY_IPC_INTERRUPTS_PER_INSTANCE])
/* ipcChannel comprises of total number of channels present in all IPC IP instances */
#define CY_IPC_PIPE_COMPUTE_INTR_MASK(ipcChannel, ipcIntrmask)                   (((ipcChannel)<CY_IPC_CHANNELS_PER_INSTANCE)?(ipcIntrmask):((((ipcIntrmask)&0xFFFF0000U) != 0x0U)?((ipcIntrmask)>>CY_IPC_CHANNELS_PER_INSTANCE):(ipcIntrmask)))
/* ipcChannel comprises of total number of channels present in all IPC IP instances */
#define CY_IPC_PIPE_CHANNEL_NUMBER_WITHIN_INSTANCE(ipcChannel)                  (((ipcChannel)%CY_IPC_CHANNELS_PER_INSTANCE))
#define CY_IPC_PIPE_INTR_NUMBER_WITHIN_INSTANCE(ipcIntr)                        (((ipcIntr)%CY_IPC_INTERRUPTS_PER_INSTANCE))

#define CY_IPC_CH_MASK(chIndex)         (0x1u << ((chIndex) % CY_IPC_CHANNELS_PER_INSTANCE))
#define CY_IPC_INTR_MASK(intrIndex)     (0x1u << ((intrIndex) % CY_IPC_INTERRUPTS_PER_INSTANCE))
#define CY_IPC0_INTR_MUX(intrIndex)     (cpuss_interrupts_ipc_0_IRQn + ((intrIndex) % CY_IPC_INTERRUPTS_PER_INSTANCE))
#define CY_IPC1_INTR_MUX(intrIndex)     (cpuss_interrupts_ipc_1_IRQn + ((intrIndex) % CY_IPC_INTERRUPTS_PER_INSTANCE))
#define CY_IPC_INTR_MUX(intrIndex)      (((intrIndex) < CY_IPC_INTERRUPTS_PER_INSTANCE) ? (CY_IPC0_INTR_MUX((intrIndex))) : (CY_IPC1_INTR_MUX((intrIndex))))

#define IPC0_SEMA_CH_NUM                (3UL)
#define IPC0_SEMA_CH_MASK               (CY_IPC_CH_MASK(IPC0_SEMA_CH_NUM))
/* Syspm IP Semaphore Macros */
#define CY_SYSPM_SEMA_NUM_MULTI_CORE         10UL
#define CY_SYSPM_SEMA_POST_TRIM_STATUS       11UL

#ifdef WA__PM_0159902_6
    /* Used as lock for RRAM write operation */
    #define CY_IPC_CHAN_RRAM_LOCK           (2UL)
#endif

/* CM33 S IPC channel 16 for RPC */
#define CM33_S_IPC1_RPC_CH_NUM          (0x0u + IPC0_IPC_NR)
#define CM33_S_IPC1_RPC_CH_MASK         (CY_IPC_CH_MASK(CM33_S_IPC1_RPC_CH_NUM))
#define CM33_S_IPC1_RPC_INTR_NUM        (0x0u + IPC0_IPC_IRQ_NR)
#define CM33_S_IPC1_RPC_INTR_MASK       (CY_IPC_INTR_MASK(CM33_S_IPC1_RPC_INTR_NUM))
#define CM33_S_IPC1_RPC_INTR_MUX        (CY_IPC1_INTR_MUX(CM33_S_IPC1_RPC_INTR_NUM))

/** IPC Semaphores allocation */
#define CY_IPC_SEMA_COUNT               (128UL)  /* <<< This will allow 128 (4*32) semaphores */

#define CY_IPC_SECURE_SEMA_DEVICE       (1UL)   /** Define this for enabling secure semaphore in ipc sema driver */

/* Secure Service IPC client */
#define CY_IPC_MSG_SECURE_SERVICES      (2UL)

/* CY_USE_RPC_CALL = 1, use RPC intergace for secure services */
#ifndef CY_USE_RPC_CALL
    #define CY_USE_RPC_CALL 0U
#endif //CY_USE_RPC_CALL

#if (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    #ifndef CY_USE_FULL_PROTECTION
        #define CY_USE_FULL_PROTECTION 0U
    #endif
    /* CY_PDL_CUSTOM_RPC = 1, use PDL RPC interface implementation */
    #ifndef CY_PDL_CUSTOM_RPC
        #define CY_PDL_CUSTOM_RPC 1U
    #endif
    /* CY_OMIT_PDL_PPC_SERVICES = 0, do not use PDL PPC serivce */
    #ifndef  CY_OMIT_PDL_PPC_SERVICES
        #define CY_OMIT_PDL_PPC_SERVICES 0U
    #endif
#endif //CY_USE_RPC_CALL =1


/** Following IPC resources are for user:
* IPC0 CH  - 3 to 7 and 11 to 15
* IPC0 INT - 3 to 5
* IPC1 CH  - 17 to 31
* IPC1 INT - 9 to 15
*/
/* user IPC channel */
#define CY_IPC0_CHAN_USER                (4u)   /** User ipc channel index of IPC0 instance */
/* user IPC interrupt */
#define CY_IPC0_INTR_USER                (2u)   /** First ipc interrupt index of IPC0 instance */

/* user IPC channel */
#define CY_IPC_CHAN_USER                 (1u + IPC0_IPC_NR)   /** First ipc channel index of IPC1 instance meant for CM33 <-> CM55 */
/* user IPC interrupt */
#define CY_IPC_INTR_USER                 (1u + IPC0_IPC_IRQ_NR)   /** First ipc interrupt index of IPC1 instance meant for CM33 <-> CM55 */

/* These definitions will be removed in the next release */
/* IPC0 channel-2 and interrupt-2 also reserved for secure domain */
#define CM33_NS_IPC0_CH_NUM             (0x5u)
#define CM33_NS_IPC0_CH_MASK            (CY_IPC_CH_MASK(CM33_NS_IPC0_CH_NUM))
#define CM33_NS_IPC0_INTR_NUM           (0x5u)
#define CM33_NS_IPC0_INTR_MASK          (CY_IPC_INTR_MASK(CM33_NS_IPC0_INTR_NUM))
#define CM33_NS_IPC0_INTR_MUX           (CY_IPC0_INTR_MUX(CM33_NS_IPC0_INTR_NUM))

