PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                LIN
*******************************************************************************/
#if defined (CY_IP_MXLIN)
    #define LIN0_CH1                                ((LIN_CH_Type*) &LIN0->CH[1])
    #define LIN0_CH2                                ((LIN_CH_Type*) &LIN0->CH[2])
    #define LIN0_CH3                                ((LIN_CH_Type*) &LIN0->CH[3])
    #define LIN0_CH4                                ((LIN_CH_Type*) &LIN0->CH[4])
    #define LIN0_CH5                                ((LIN_CH_Type*) &LIN0->CH[5])
    #define LIN0_CH6                                ((LIN_CH_Type*) &LIN0->CH[6])
    #define LIN0_CH7                                ((LIN_CH_Type*) &LIN0->CH[7])
    #define LIN0_CH8                                ((LIN_CH_Type*) &LIN0->CH[8])
    #define LIN0_CH9                                ((LIN_CH_Type*) &LIN0->CH[9])
    #define LIN0_CH10                               ((LIN_CH_Type*) &LIN0->CH[10])
    #define LIN0_CH11                               ((LIN_CH_Type*) &LIN0->CH[11])
    #define LIN0_CH12                               ((LIN_CH_Type*) &LIN0->CH[12])
    #define LIN0_CH13                               ((LIN_CH_Type*) &LIN0->CH[13])
    #define LIN0_CH14                               ((LIN_CH_Type*) &LIN0->CH[14])
    #define LIN0_CH15                               ((LIN_CH_Type*) &LIN0->CH[15])
    #define LIN0_CH16                               ((LIN_CH_Type*) &LIN0->CH[16])
    #define LIN0_CH17                               ((LIN_CH_Type*) &LIN0->CH[17])
    #define LIN0_CH18                               ((LIN_CH_Type*) &LIN0->CH[18])
    #define LIN0_CH19                               ((LIN_CH_Type*) &LIN0->CH[19])
    #define LIN0_CH20                               ((LIN_CH_Type*) &LIN0->CH[20])
    #define LIN0_CH21                               ((LIN_CH_Type*) &LIN0->CH[21])
    #define LIN0_CH22                               ((LIN_CH_Type*) &LIN0->CH[22])
    #define LIN0_CH23                               ((LIN_CH_Type*) &LIN0->CH[23])
    #define LIN0_CH24                               ((LIN_CH_Type*) &LIN0->CH[24])
    #define LIN0_CH25                               ((LIN_CH_Type*) &LIN0->CH[25])
    #define LIN0_CH26                               ((LIN_CH_Type*) &LIN0->CH[26])
    #define LIN0_CH27                               ((LIN_CH_Type*) &LIN0->CH[27])
    #define LIN0_CH28                               ((LIN_CH_Type*) &LIN0->CH[28])
    #define LIN0_CH29                               ((LIN_CH_Type*) &LIN0->CH[29])
    #define LIN0_CH30                               ((LIN_CH_Type*) &LIN0->CH[30])
    #define LIN0_CH31                               ((LIN_CH_Type*) &LIN0->CH[31])

    #define LIN_CH_CTL0(base)                       (((LIN_CH_Type *)(base))->CTL0)
    #define LIN_CH_CTL1(base)                       (((LIN_CH_Type *)(base))->CTL1)
    #define LIN_CH_STATUS(base)                     (((LIN_CH_Type *)(base))->STATUS)
    #define LIN_CH_CMD(base)                        (((LIN_CH_Type *)(base))->CMD)
    #define LIN_CH_TX_RX_STATUS(base)               (((LIN_CH_Type *)(base))->TX_RX_STATUS)
    #define LIN_CH_PID_CHECKSUM(base)               (((LIN_CH_Type *)(base))->PID_CHECKSUM)
    #define LIN_CH_DATA0(base)                      (((LIN_CH_Type *)(base))->DATA0)
    #define LIN_CH_DATA1(base)                      (((LIN_CH_Type *)(base))->DATA1)
    #define LIN_CH_INTR(base)                       (((LIN_CH_Type *)(base))->INTR)
    #define LIN_CH_INTR_SET(base)                   (((LIN_CH_Type *)(base))->INTR_SET)
    #define LIN_CH_INTR_MASK(base)                  (((LIN_CH_Type *)(base))->INTR_MASK)
    #define LIN_CH_INTR_MASKED(base)                (((LIN_CH_Type *)(base))->INTR_MASKED)

    #define LIN_ERROR_CTL(base)                     (((LIN_Type *)(base))->ERROR_CTL)
    #define LIN_TEST_CTL(base)                      (((LIN_Type *)(base))->TEST_CTL)
#endif /* CY_IP_MXLIN */

/*******************************************************************************
*                MXKEYSCAN
*******************************************************************************/
#if defined (CY_IP_MXKEYSCAN)

    #define KEYSCAN_CTL(base)                       (((MXKEYSCAN_Type *)(base))->KEYSCAN_CTL)
    #define KEYSCAN_DEBOUNCE(base)                  (((MXKEYSCAN_Type *)(base))->DEBOUNCE)
    #define KEYSCAN_KEYFIFO_CNT(base)               (((MXKEYSCAN_Type *)(base))->KEYFIFO_CNT)
    #define KEYSCAN_KEYFIFO(base)                   (((MXKEYSCAN_Type *)(base))->KEYFIFO)
    #define KEYSCAN_MIA_CTL(base)                   (((MXKEYSCAN_Type *)(base))->MIA_CTL)
    #define KEYSCAN_MIA_STATUS(base)                (((MXKEYSCAN_Type *)(base))->MIA_STATUS)
    #define KEYSCAN_KSI_USED(base)                  (((MXKEYSCAN_Type *)(base))->KSI_USED)
    #define KEYSCAN_INTR(base)                      (((MXKEYSCAN_Type *)(base))->INTR)
    #define KEYSCAN_INTR_SET(base)                  (((MXKEYSCAN_Type *)(base))->INTR_SET)
    #define KEYSCAN_INTR_MASK(base)                 (((MXKEYSCAN_Type *)(base))->INTR_MASK)
    #define KEYSCAN_INTR_MASKED(base)               (((MXKEYSCAN_Type *)(base))->INTR_MASKED)

#endif /* CY_IP_MXKEYSCAN */

#define MPC_Type                                 RAMC_MPC_Type
#ifdef RAMC_MPC_PC_NR
    #define MPC_PC_NR                                RAMC_MPC_PC_NR
#else
    #define MPC_PC_NR                                RAMC0_MPC_PC_NR
#endif

/*******************************************************************************
*                MS_CTL for SYSCPUSS
*******************************************************************************/
#if CY_IP_MXCM33_VERSION_MINOR == (0u)

    #define MS_CTL_PC_CTL_VX(index)          (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->MS[(index)].CTL)
    #define MS_CTL_PC_VAL_VX(index)          (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->MS_PC[(index)].PC)
    #define MS_CTL_PC_READ_MIRROR_VX(index)  (((MS_CTL_2_0_Type*) GET_NSALIAS_ADDRESS(MS_CTL_2_0_BASE))->MS_PC[(index)].PC_READ_MIR)
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_VX   (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->CODE_MS0_MSC_ACG_CTL)
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_VX    (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->SYS_MS0_MSC_ACG_CTL)
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_VX    (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->SYS_MS1_MSC_ACG_CTL)
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_VX     (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->EXP_MS_MSC_ACG_CTL)
    #define MS_CTL_DMAC0_MSC_ACG_CTL_VX      (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->DMAC0_MSC_ACG_CTL)
    #define MS_CTL_DMAC1_MSC_ACG_CTL_VX      (((MS_CTL_2_0_Type*) MS_CTL_2_0_BASE)->DMAC1_MSC_ACG_CTL)

    /* MS_CTL.CODE_MS0_MSC_ACG_CTL */
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos   MS_CTL_2_0_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk   MS_CTL_2_0_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_VX_Pos        MS_CTL_2_0_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_VX_Msk        MS_CTL_2_0_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.SYS_MS0_MSC_ACG_CTL */
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos    MS_CTL_2_0_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk    MS_CTL_2_0_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_VX_Pos         MS_CTL_2_0_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_VX_Msk         MS_CTL_2_0_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.SYS_MS1_MSC_ACG_CTL */
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos    MS_CTL_2_0_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk    MS_CTL_2_0_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_VX_Pos         MS_CTL_2_0_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_VX_Msk         MS_CTL_2_0_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.EXP_MS_MSC_ACG_CTL */
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos     MS_CTL_2_0_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk     MS_CTL_2_0_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_VX_Pos          MS_CTL_2_0_EXP_MS_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_VX_Msk          MS_CTL_2_0_EXP_MS_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.DMAC0_MSC_ACG_CTL */
    #define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos      MS_CTL_2_0_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk      MS_CTL_2_0_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_VX_Pos           MS_CTL_2_0_DMAC0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_VX_Msk           MS_CTL_2_0_DMAC0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.DMAC1_MSC_ACG_CTL */
    #define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos      MS_CTL_2_0_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk      MS_CTL_2_0_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_VX_Pos           MS_CTL_2_0_DMAC1_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_VX_Msk           MS_CTL_2_0_DMAC1_MSC_ACG_CTL_SEC_RESP_Msk

#else

