PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
    #define MS_CTL_PC_CTL_VX(index)          (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->MS[(index)].CTL)
    #define MS_CTL_PC_VAL_VX(index)          (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->MS_PC[(index)].PC)
    #define MS_CTL_PC_READ_MIRROR_VX(index)  (((MS_CTL_2_1_Type*) GET_NSALIAS_ADDRESS(MS_CTL_2_1_BASE))->MS_PC[(index)].PC_READ_MIR)
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_VX   (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->CODE_MS0_MSC_ACG_CTL)
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_VX    (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->SYS_MS0_MSC_ACG_CTL)
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_VX    (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->SYS_MS1_MSC_ACG_CTL)
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_VX     (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->EXP_MS_MSC_ACG_CTL)
    #define MS_CTL_DMAC0_MSC_ACG_CTL_VX      (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->DMAC0_MSC_ACG_CTL)
    #define MS_CTL_DMAC1_MSC_ACG_CTL_VX      (((MS_CTL_2_1_Type*) MS_CTL_2_1_BASE)->DMAC1_MSC_ACG_CTL)

    /* MS_CTL.CODE_MS0_MSC_ACG_CTL */
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos   MS_CTL_2_1_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk   MS_CTL_2_1_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_VX_Pos        MS_CTL_2_1_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_VX_Msk        MS_CTL_2_1_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.SYS_MS0_MSC_ACG_CTL */
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos    MS_CTL_2_1_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk    MS_CTL_2_1_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_VX_Pos         MS_CTL_2_1_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_VX_Msk         MS_CTL_2_1_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.SYS_MS1_MSC_ACG_CTL */
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos    MS_CTL_2_1_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk    MS_CTL_2_1_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_VX_Pos         MS_CTL_2_1_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_VX_Msk         MS_CTL_2_1_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.EXP_MS_MSC_ACG_CTL */
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos     MS_CTL_2_1_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk     MS_CTL_2_1_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_VX_Pos          MS_CTL_2_1_EXP_MS_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_VX_Msk          MS_CTL_2_1_EXP_MS_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.DMAC0_MSC_ACG_CTL */
    #define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos      MS_CTL_2_1_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk      MS_CTL_2_1_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_VX_Pos           MS_CTL_2_1_DMAC0_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_VX_Msk           MS_CTL_2_1_DMAC0_MSC_ACG_CTL_SEC_RESP_Msk
    /* MS_CTL.DMAC1_MSC_ACG_CTL */
    #define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Pos      MS_CTL_2_1_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
    #define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_VX_Msk      MS_CTL_2_1_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
    #define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_VX_Pos           MS_CTL_2_1_DMAC1_MSC_ACG_CTL_SEC_RESP_Pos
    #define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_VX_Msk           MS_CTL_2_1_DMAC1_MSC_ACG_CTL_SEC_RESP_Msk

#endif

/*******************************************************************************
*                MS_CTL for APPCPUSS
*******************************************************************************/
#define MS_CTL_PC_CTL_V1(index)          (((MS_CTL_Type*) MS_CTL_BASE)->MS[(index)].CTL)
#define MS_CTL_PC_VAL_V1(index)          (((MS_CTL_Type*) MS_CTL_BASE)->MS_PC[(index)].PC)
#define MS_CTL_PC_READ_MIRROR_V1(index)  (((MS_CTL_Type*) MS_CTL_BASE)->MS_PC[(index)].PC_READ_MIR)
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->SYS_MS0_MSC_ACG_CTL)
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->SYS_MS1_MSC_ACG_CTL)
#define MS_CTL_AXIDMAC0_MSC_ACG_CTL_V1   (((MS_CTL_Type*) MS_CTL_BASE)->AXIDMAC0_MSC_ACG_CTL)
#define MS_CTL_AXIDMAC1_MSC_ACG_CTL_V1   (((MS_CTL_Type*) MS_CTL_BASE)->AXIDMAC1_MSC_ACG_CTL)
#define MS_CTL_AXI_MS0_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->AXI_MS0_MSC_ACG_CTL)
#define MS_CTL_AXI_MS1_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->AXI_MS1_MSC_ACG_CTL)
#define MS_CTL_AXI_MS2_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->AXI_MS2_MSC_ACG_CTL)
#define MS_CTL_AXI_MS3_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->AXI_MS3_MSC_ACG_CTL)
#define MS_CTL_EXP_MS0_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->EXP_MS0_MSC_ACG_CTL)
#define MS_CTL_EXP_MS1_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->EXP_MS1_MSC_ACG_CTL)
#define MS_CTL_EXP_MS2_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->EXP_MS2_MSC_ACG_CTL)
#define MS_CTL_EXP_MS3_MSC_ACG_CTL_V1    (((MS_CTL_Type*) MS_CTL_BASE)->EXP_MS3_MSC_ACG_CTL)

/* MS_CTL.SYS_MS0_MSC_ACG_CTL */
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.SYS_MS1_MSC_ACG_CTL */
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXIDMAC0_MSC_ACG_CTL */
#define MS_CTL_AXIDMAC0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos   MS_CTL_AXIDMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXIDMAC0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk   MS_CTL_AXIDMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXIDMAC0_MSC_ACG_CTL_SEC_RESP_V1_Pos        MS_CTL_AXIDMAC0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXIDMAC0_MSC_ACG_CTL_SEC_RESP_V1_Msk        MS_CTL_AXIDMAC0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXIDMAC1_MSC_ACG_CTL */
#define MS_CTL_AXIDMAC1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos   MS_CTL_AXIDMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXIDMAC1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk   MS_CTL_AXIDMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXIDMAC1_MSC_ACG_CTL_SEC_RESP_V1_Pos        MS_CTL_AXIDMAC1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXIDMAC1_MSC_ACG_CTL_SEC_RESP_V1_Msk        MS_CTL_AXIDMAC1_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXI_MS0_MSC_ACG_CTL */
#define MS_CTL_AXI_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_AXI_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXI_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_AXI_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXI_MS0_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_AXI_MS0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXI_MS0_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_AXI_MS0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXI_MS1_MSC_ACG_CTL */
#define MS_CTL_AXI_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_AXI_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXI_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_AXI_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXI_MS1_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_AXI_MS1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXI_MS1_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_AXI_MS1_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXI_MS2_MSC_ACG_CTL */
#define MS_CTL_AXI_MS2_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_AXI_MS2_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXI_MS2_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_AXI_MS2_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXI_MS2_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_AXI_MS2_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXI_MS2_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_AXI_MS2_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.AXI_MS3_MSC_ACG_CTL */
#define MS_CTL_AXI_MS3_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_AXI_MS3_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_AXI_MS3_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_AXI_MS3_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_AXI_MS3_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_AXI_MS3_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_AXI_MS3_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_AXI_MS3_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.EXP_MS0_MSC_ACG_CTL */
#define MS_CTL_EXP_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_EXP_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_EXP_MS0_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_EXP_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_EXP_MS0_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_EXP_MS0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_EXP_MS0_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_EXP_MS0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.EXP_MS1_MSC_ACG_CTL */
#define MS_CTL_EXP_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_EXP_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_EXP_MS1_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_EXP_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_EXP_MS1_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_EXP_MS1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_EXP_MS1_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_EXP_MS1_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.EXP_MS2_MSC_ACG_CTL */
#define MS_CTL_EXP_MS2_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_EXP_MS2_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_EXP_MS2_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_EXP_MS2_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_EXP_MS2_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_EXP_MS2_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_EXP_MS2_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_EXP_MS2_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.EXP_MS3_MSC_ACG_CTL */
#define MS_CTL_EXP_MS3_MSC_ACG_CTL_CFG_GATE_RESP_V1_Pos    MS_CTL_EXP_MS3_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_EXP_MS3_MSC_ACG_CTL_CFG_GATE_RESP_V1_Msk    MS_CTL_EXP_MS3_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_EXP_MS3_MSC_ACG_CTL_SEC_RESP_V1_Pos         MS_CTL_EXP_MS3_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_EXP_MS3_MSC_ACG_CTL_SEC_RESP_V1_Msk         MS_CTL_EXP_MS3_MSC_ACG_CTL_SEC_RESP_Msk

