PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/cy_device.h
/*******************************************************************************
*                MXSRAMC
*******************************************************************************/
#define CY_MXSRAMC_BASE(sramNum)                        ((uint32_t)((uint32_t)RAMC0_BASE + (((uint32_t)(sramNum)) * 0x10000U )))
#define MXSRAMC_STATUS(sramNum)                         (((RAMC_Type *) CY_MXSRAMC_BASE(sramNum))->STATUS)
#define MXSRAMC_PWR_MACRO_CTL(sramNum)                  (((RAMC_Type *) CY_MXSRAMC_BASE(sramNum))->PWR_MACRO_CTL)
#define MXSRAMC_PWR_MACRO_CTL_LOCK(sramNum)             (((RAMC_Type *) CY_MXSRAMC_BASE(sramNum))->PWR_MACRO_CTL_LOCK)


#define MXSRAMC_PWR_MACRO_CTL_LOCK_CLR0                 0X00000001U
#define MXSRAMC_PWR_MACRO_CTL_LOCK_CLR1                 0X00000002U
#define MXSRAMC_PWR_MACRO_CTL_LOCK_SET01                0X00000003U
#define CY_CPUSS_RAMC_MACRO_NR(sramNum)                 ((((uint32_t)(sramNum)) == 0U)? CPUSS_RAMC0_MACRO_NR : CPUSS_RAMC1_MACRO_NR)

/*******************************************************************************
*                MXSOCMEM
*******************************************************************************/
#define CY_SOCMEM_PARTITION_NR                          (SOCMEM_SRAM_PARTITION_NR)

#define SOCMEM_PWR_PARTITION_CTL_LOCK_CLR0              0X00000001U
#define SOCMEM_PWR_PARTITION_CTL_LOCK_CLR1              0X00000002U
#define SOCMEM_PWR_PARTITION_CTL_LOCK_SET01             0X00000003U


#define SOCMEM_PWR_PARTITION_CTL(partNum)               (((SOCMEM_Type *) SOCMEM)->PWR_PARTITION_CTL[partNum])
#define SOCMEM_PWR_PARTITION_CTL_LOCK                   (((SOCMEM_Type *) SOCMEM)->PWR_PARTITION_CTL_LOCK)
#define SOCMEM_PWR_STATUS                               (((SOCMEM_Type *) SOCMEM)->PWR_STATUS)


/*******************************************************************************
*                PPC
*******************************************************************************/

#define PPC_VALIDATE(ipInst, regionID)                  ((((ipInst) == PPC0) && ((regionID) <= (uint32_t)PROT_PERI0_END)) || \
                                                         (((ipInst) == PPC1) && ((regionID) <= (uint32_t)PROT_PERI1_END))? true : false)

/*******************************************************************************
*                CRYPTO
*******************************************************************************/

/* The CRYPTO internal-memory buffer-size in 32-bit words. */
#define CY_CRYPTO_MEM_BUFF_SIZE_U32         (1024U)

/* Redirect to Crypto IP macros. Crypto IP macros don't have CPUSS_ prefix */
#define CPUSS_CRYPTO_ECC_PRESENT CRYPTO_ECC_PRESENT
#define CPUSS_CRYPTO_ECC_ADDR_PRESENT CRYPTO_ECC_ADDR_PRESENT
#define CPUSS_CRYPTO_AES CRYPTO_AES
#define CPUSS_CRYPTO_DES CRYPTO_DES
#define CPUSS_CRYPTO_CHACHA CRYPTO_CHACHA
#define CPUSS_CRYPTO_PR CRYPTO_PR
#define CPUSS_CRYPTO_SHA1 CRYPTO_SHA1
#define CPUSS_CRYPTO_SHA2 CRYPTO_SHA2
#define CPUSS_CRYPTO_SHA3 CRYPTO_SHA3
#define CPUSS_CRYPTO_CRC CRYPTO_CRC
#define CPUSS_CRYPTO_TR CRYPTO_TR
#define CPUSS_CRYPTO_VU CRYPTO_VU
#define CPUSS_CRYPTO_GCM CRYPTO_GCM

/*******************************************************************************
*                MXCM33
*******************************************************************************/
#define MXCM33_CM33_STATUS                     (((MXCM33_Type*) MXCM33_BASE)->CM33_STATUS)

/*******************************************************************************
*                MXCM55
*******************************************************************************/
#define MXCM55_CM55_STATUS                     (((MXCM55_Type*) MXCM55_BASE)->CM55_STATUS)


CY_MISRA_BLOCK_END('MISRA C-2012 Rule 8.6')

#endif /* CY_DEVICE_H_ */

/* [] END OF FILE */
